bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/**
  ******************************************************************************
  * @file    sf_ctrl_reg.h
  * @version V1.0
  * @date    2021-07-13
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __SF_CTRL_REG_H__
#define  __SF_CTRL_REG_H__

#include "bl702l.h"

/* 0x0 : sf_ctrl_0 */
#define SF_CTRL_0_OFFSET                                        (0x0)
#define SF_CTRL_SF_CLK_SF_RX_INV_SEL                            SF_CTRL_SF_CLK_SF_RX_INV_SEL
#define SF_CTRL_SF_CLK_SF_RX_INV_SEL_POS                        (2U)
#define SF_CTRL_SF_CLK_SF_RX_INV_SEL_LEN                        (1U)
#define SF_CTRL_SF_CLK_SF_RX_INV_SEL_MSK                        (((1U<<SF_CTRL_SF_CLK_SF_RX_INV_SEL_LEN)-1)<<SF_CTRL_SF_CLK_SF_RX_INV_SEL_POS)
#define SF_CTRL_SF_CLK_SF_RX_INV_SEL_UMSK                       (~(((1U<<SF_CTRL_SF_CLK_SF_RX_INV_SEL_LEN)-1)<<SF_CTRL_SF_CLK_SF_RX_INV_SEL_POS))
#define SF_CTRL_SF_CLK_OUT_GATE_EN                              SF_CTRL_SF_CLK_OUT_GATE_EN
#define SF_CTRL_SF_CLK_OUT_GATE_EN_POS                          (3U)
#define SF_CTRL_SF_CLK_OUT_GATE_EN_LEN                          (1U)
#define SF_CTRL_SF_CLK_OUT_GATE_EN_MSK                          (((1U<<SF_CTRL_SF_CLK_OUT_GATE_EN_LEN)-1)<<SF_CTRL_SF_CLK_OUT_GATE_EN_POS)
#define SF_CTRL_SF_CLK_OUT_GATE_EN_UMSK                         (~(((1U<<SF_CTRL_SF_CLK_OUT_GATE_EN_LEN)-1)<<SF_CTRL_SF_CLK_OUT_GATE_EN_POS))
#define SF_CTRL_SF_CLK_OUT_INV_SEL                              SF_CTRL_SF_CLK_OUT_INV_SEL
#define SF_CTRL_SF_CLK_OUT_INV_SEL_POS                          (4U)
#define SF_CTRL_SF_CLK_OUT_INV_SEL_LEN                          (1U)
#define SF_CTRL_SF_CLK_OUT_INV_SEL_MSK                          (((1U<<SF_CTRL_SF_CLK_OUT_INV_SEL_LEN)-1)<<SF_CTRL_SF_CLK_OUT_INV_SEL_POS)
#define SF_CTRL_SF_CLK_OUT_INV_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_CLK_OUT_INV_SEL_LEN)-1)<<SF_CTRL_SF_CLK_OUT_INV_SEL_POS))
#define SF_CTRL_SF_IF_READ_DLY_N                                SF_CTRL_SF_IF_READ_DLY_N
#define SF_CTRL_SF_IF_READ_DLY_N_POS                            (8U)
#define SF_CTRL_SF_IF_READ_DLY_N_LEN                            (3U)
#define SF_CTRL_SF_IF_READ_DLY_N_MSK                            (((1U<<SF_CTRL_SF_IF_READ_DLY_N_LEN)-1)<<SF_CTRL_SF_IF_READ_DLY_N_POS)
#define SF_CTRL_SF_IF_READ_DLY_N_UMSK                           (~(((1U<<SF_CTRL_SF_IF_READ_DLY_N_LEN)-1)<<SF_CTRL_SF_IF_READ_DLY_N_POS))
#define SF_CTRL_SF_IF_READ_DLY_EN                               SF_CTRL_SF_IF_READ_DLY_EN
#define SF_CTRL_SF_IF_READ_DLY_EN_POS                           (11U)
#define SF_CTRL_SF_IF_READ_DLY_EN_LEN                           (1U)
#define SF_CTRL_SF_IF_READ_DLY_EN_MSK                           (((1U<<SF_CTRL_SF_IF_READ_DLY_EN_LEN)-1)<<SF_CTRL_SF_IF_READ_DLY_EN_POS)
#define SF_CTRL_SF_IF_READ_DLY_EN_UMSK                          (~(((1U<<SF_CTRL_SF_IF_READ_DLY_EN_LEN)-1)<<SF_CTRL_SF_IF_READ_DLY_EN_POS))
#define SF_CTRL_SF_IF_INT                                       SF_CTRL_SF_IF_INT
#define SF_CTRL_SF_IF_INT_POS                                   (16U)
#define SF_CTRL_SF_IF_INT_LEN                                   (1U)
#define SF_CTRL_SF_IF_INT_MSK                                   (((1U<<SF_CTRL_SF_IF_INT_LEN)-1)<<SF_CTRL_SF_IF_INT_POS)
#define SF_CTRL_SF_IF_INT_UMSK                                  (~(((1U<<SF_CTRL_SF_IF_INT_LEN)-1)<<SF_CTRL_SF_IF_INT_POS))
#define SF_CTRL_SF_IF_INT_CLR                                   SF_CTRL_SF_IF_INT_CLR
#define SF_CTRL_SF_IF_INT_CLR_POS                               (17U)
#define SF_CTRL_SF_IF_INT_CLR_LEN                               (1U)
#define SF_CTRL_SF_IF_INT_CLR_MSK                               (((1U<<SF_CTRL_SF_IF_INT_CLR_LEN)-1)<<SF_CTRL_SF_IF_INT_CLR_POS)
#define SF_CTRL_SF_IF_INT_CLR_UMSK                              (~(((1U<<SF_CTRL_SF_IF_INT_CLR_LEN)-1)<<SF_CTRL_SF_IF_INT_CLR_POS))
#define SF_CTRL_SF_IF_INT_SET                                   SF_CTRL_SF_IF_INT_SET
#define SF_CTRL_SF_IF_INT_SET_POS                               (18U)
#define SF_CTRL_SF_IF_INT_SET_LEN                               (1U)
#define SF_CTRL_SF_IF_INT_SET_MSK                               (((1U<<SF_CTRL_SF_IF_INT_SET_LEN)-1)<<SF_CTRL_SF_IF_INT_SET_POS)
#define SF_CTRL_SF_IF_INT_SET_UMSK                              (~(((1U<<SF_CTRL_SF_IF_INT_SET_LEN)-1)<<SF_CTRL_SF_IF_INT_SET_POS))
#define SF_CTRL_SF_IF_32B_ADR_EN                                SF_CTRL_SF_IF_32B_ADR_EN
#define SF_CTRL_SF_IF_32B_ADR_EN_POS                            (19U)
#define SF_CTRL_SF_IF_32B_ADR_EN_LEN                            (1U)
#define SF_CTRL_SF_IF_32B_ADR_EN_MSK                            (((1U<<SF_CTRL_SF_IF_32B_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_32B_ADR_EN_POS)
#define SF_CTRL_SF_IF_32B_ADR_EN_UMSK                           (~(((1U<<SF_CTRL_SF_IF_32B_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_32B_ADR_EN_POS))
#define SF_CTRL_SF_AES_DOUT_ENDIAN                              SF_CTRL_SF_AES_DOUT_ENDIAN
#define SF_CTRL_SF_AES_DOUT_ENDIAN_POS                          (20U)
#define SF_CTRL_SF_AES_DOUT_ENDIAN_LEN                          (1U)
#define SF_CTRL_SF_AES_DOUT_ENDIAN_MSK                          (((1U<<SF_CTRL_SF_AES_DOUT_ENDIAN_LEN)-1)<<SF_CTRL_SF_AES_DOUT_ENDIAN_POS)
#define SF_CTRL_SF_AES_DOUT_ENDIAN_UMSK                         (~(((1U<<SF_CTRL_SF_AES_DOUT_ENDIAN_LEN)-1)<<SF_CTRL_SF_AES_DOUT_ENDIAN_POS))
#define SF_CTRL_SF_AES_DIN_ENDIAN                               SF_CTRL_SF_AES_DIN_ENDIAN
#define SF_CTRL_SF_AES_DIN_ENDIAN_POS                           (21U)
#define SF_CTRL_SF_AES_DIN_ENDIAN_LEN                           (1U)
#define SF_CTRL_SF_AES_DIN_ENDIAN_MSK                           (((1U<<SF_CTRL_SF_AES_DIN_ENDIAN_LEN)-1)<<SF_CTRL_SF_AES_DIN_ENDIAN_POS)
#define SF_CTRL_SF_AES_DIN_ENDIAN_UMSK                          (~(((1U<<SF_CTRL_SF_AES_DIN_ENDIAN_LEN)-1)<<SF_CTRL_SF_AES_DIN_ENDIAN_POS))
#define SF_CTRL_SF_AES_KEY_ENDIAN                               SF_CTRL_SF_AES_KEY_ENDIAN
#define SF_CTRL_SF_AES_KEY_ENDIAN_POS                           (22U)
#define SF_CTRL_SF_AES_KEY_ENDIAN_LEN                           (1U)
#define SF_CTRL_SF_AES_KEY_ENDIAN_MSK                           (((1U<<SF_CTRL_SF_AES_KEY_ENDIAN_LEN)-1)<<SF_CTRL_SF_AES_KEY_ENDIAN_POS)
#define SF_CTRL_SF_AES_KEY_ENDIAN_UMSK                          (~(((1U<<SF_CTRL_SF_AES_KEY_ENDIAN_LEN)-1)<<SF_CTRL_SF_AES_KEY_ENDIAN_POS))
#define SF_CTRL_SF_AES_IV_ENDIAN                                SF_CTRL_SF_AES_IV_ENDIAN
#define SF_CTRL_SF_AES_IV_ENDIAN_POS                            (23U)
#define SF_CTRL_SF_AES_IV_ENDIAN_LEN                            (1U)
#define SF_CTRL_SF_AES_IV_ENDIAN_MSK                            (((1U<<SF_CTRL_SF_AES_IV_ENDIAN_LEN)-1)<<SF_CTRL_SF_AES_IV_ENDIAN_POS)
#define SF_CTRL_SF_AES_IV_ENDIAN_UMSK                           (~(((1U<<SF_CTRL_SF_AES_IV_ENDIAN_LEN)-1)<<SF_CTRL_SF_AES_IV_ENDIAN_POS))
#define SF_CTRL_SF_ID                                           SF_CTRL_SF_ID
#define SF_CTRL_SF_ID_POS                                       (24U)
#define SF_CTRL_SF_ID_LEN                                       (8U)
#define SF_CTRL_SF_ID_MSK                                       (((1U<<SF_CTRL_SF_ID_LEN)-1)<<SF_CTRL_SF_ID_POS)
#define SF_CTRL_SF_ID_UMSK                                      (~(((1U<<SF_CTRL_SF_ID_LEN)-1)<<SF_CTRL_SF_ID_POS))

