bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x4 : sf_ctrl_1 */
#define SF_CTRL_1_OFFSET                                        (0x4)
#define SF_CTRL_SF_IF_SR_PAT_MASK                               SF_CTRL_SF_IF_SR_PAT_MASK
#define SF_CTRL_SF_IF_SR_PAT_MASK_POS                           (0U)
#define SF_CTRL_SF_IF_SR_PAT_MASK_LEN                           (8U)
#define SF_CTRL_SF_IF_SR_PAT_MASK_MSK                           (((1U<<SF_CTRL_SF_IF_SR_PAT_MASK_LEN)-1)<<SF_CTRL_SF_IF_SR_PAT_MASK_POS)
#define SF_CTRL_SF_IF_SR_PAT_MASK_UMSK                          (~(((1U<<SF_CTRL_SF_IF_SR_PAT_MASK_LEN)-1)<<SF_CTRL_SF_IF_SR_PAT_MASK_POS))
#define SF_CTRL_SF_IF_SR_PAT                                    SF_CTRL_SF_IF_SR_PAT
#define SF_CTRL_SF_IF_SR_PAT_POS                                (8U)
#define SF_CTRL_SF_IF_SR_PAT_LEN                                (8U)
#define SF_CTRL_SF_IF_SR_PAT_MSK                                (((1U<<SF_CTRL_SF_IF_SR_PAT_LEN)-1)<<SF_CTRL_SF_IF_SR_PAT_POS)
#define SF_CTRL_SF_IF_SR_PAT_UMSK                               (~(((1U<<SF_CTRL_SF_IF_SR_PAT_LEN)-1)<<SF_CTRL_SF_IF_SR_PAT_POS))
#define SF_CTRL_SF_IF_SR_INT                                    SF_CTRL_SF_IF_SR_INT
#define SF_CTRL_SF_IF_SR_INT_POS                                (16U)
#define SF_CTRL_SF_IF_SR_INT_LEN                                (1U)
#define SF_CTRL_SF_IF_SR_INT_MSK                                (((1U<<SF_CTRL_SF_IF_SR_INT_LEN)-1)<<SF_CTRL_SF_IF_SR_INT_POS)
#define SF_CTRL_SF_IF_SR_INT_UMSK                               (~(((1U<<SF_CTRL_SF_IF_SR_INT_LEN)-1)<<SF_CTRL_SF_IF_SR_INT_POS))
#define SF_CTRL_SF_IF_SR_INT_EN                                 SF_CTRL_SF_IF_SR_INT_EN
#define SF_CTRL_SF_IF_SR_INT_EN_POS                             (17U)
#define SF_CTRL_SF_IF_SR_INT_EN_LEN                             (1U)
#define SF_CTRL_SF_IF_SR_INT_EN_MSK                             (((1U<<SF_CTRL_SF_IF_SR_INT_EN_LEN)-1)<<SF_CTRL_SF_IF_SR_INT_EN_POS)
#define SF_CTRL_SF_IF_SR_INT_EN_UMSK                            (~(((1U<<SF_CTRL_SF_IF_SR_INT_EN_LEN)-1)<<SF_CTRL_SF_IF_SR_INT_EN_POS))
#define SF_CTRL_SF_IF_SR_INT_SET                                SF_CTRL_SF_IF_SR_INT_SET
#define SF_CTRL_SF_IF_SR_INT_SET_POS                            (18U)
#define SF_CTRL_SF_IF_SR_INT_SET_LEN                            (1U)
#define SF_CTRL_SF_IF_SR_INT_SET_MSK                            (((1U<<SF_CTRL_SF_IF_SR_INT_SET_LEN)-1)<<SF_CTRL_SF_IF_SR_INT_SET_POS)
#define SF_CTRL_SF_IF_SR_INT_SET_UMSK                           (~(((1U<<SF_CTRL_SF_IF_SR_INT_SET_LEN)-1)<<SF_CTRL_SF_IF_SR_INT_SET_POS))
#define SF_CTRL_SF_IF_0_ACK_LAT                                 SF_CTRL_SF_IF_0_ACK_LAT
#define SF_CTRL_SF_IF_0_ACK_LAT_POS                             (20U)
#define SF_CTRL_SF_IF_0_ACK_LAT_LEN                             (3U)
#define SF_CTRL_SF_IF_0_ACK_LAT_MSK                             (((1U<<SF_CTRL_SF_IF_0_ACK_LAT_LEN)-1)<<SF_CTRL_SF_IF_0_ACK_LAT_POS)
#define SF_CTRL_SF_IF_0_ACK_LAT_UMSK                            (~(((1U<<SF_CTRL_SF_IF_0_ACK_LAT_LEN)-1)<<SF_CTRL_SF_IF_0_ACK_LAT_POS))
#define SF_CTRL_SF_AHB2SIF_DISWRAP                              SF_CTRL_SF_AHB2SIF_DISWRAP
#define SF_CTRL_SF_AHB2SIF_DISWRAP_POS                          (23U)
#define SF_CTRL_SF_AHB2SIF_DISWRAP_LEN                          (1U)
#define SF_CTRL_SF_AHB2SIF_DISWRAP_MSK                          (((1U<<SF_CTRL_SF_AHB2SIF_DISWRAP_LEN)-1)<<SF_CTRL_SF_AHB2SIF_DISWRAP_POS)
#define SF_CTRL_SF_AHB2SIF_DISWRAP_UMSK                         (~(((1U<<SF_CTRL_SF_AHB2SIF_DISWRAP_LEN)-1)<<SF_CTRL_SF_AHB2SIF_DISWRAP_POS))
#define SF_CTRL_SF_IF_REG_HOLD                                  SF_CTRL_SF_IF_REG_HOLD
#define SF_CTRL_SF_IF_REG_HOLD_POS                              (24U)
#define SF_CTRL_SF_IF_REG_HOLD_LEN                              (1U)
#define SF_CTRL_SF_IF_REG_HOLD_MSK                              (((1U<<SF_CTRL_SF_IF_REG_HOLD_LEN)-1)<<SF_CTRL_SF_IF_REG_HOLD_POS)
#define SF_CTRL_SF_IF_REG_HOLD_UMSK                             (~(((1U<<SF_CTRL_SF_IF_REG_HOLD_LEN)-1)<<SF_CTRL_SF_IF_REG_HOLD_POS))
#define SF_CTRL_SF_IF_REG_WP                                    SF_CTRL_SF_IF_REG_WP
#define SF_CTRL_SF_IF_REG_WP_POS                                (25U)
#define SF_CTRL_SF_IF_REG_WP_LEN                                (1U)
#define SF_CTRL_SF_IF_REG_WP_MSK                                (((1U<<SF_CTRL_SF_IF_REG_WP_LEN)-1)<<SF_CTRL_SF_IF_REG_WP_POS)
#define SF_CTRL_SF_IF_REG_WP_UMSK                               (~(((1U<<SF_CTRL_SF_IF_REG_WP_LEN)-1)<<SF_CTRL_SF_IF_REG_WP_POS))
#define SF_CTRL_SF_AHB2SIF_STOPPED                              SF_CTRL_SF_AHB2SIF_STOPPED
#define SF_CTRL_SF_AHB2SIF_STOPPED_POS                          (26U)
#define SF_CTRL_SF_AHB2SIF_STOPPED_LEN                          (1U)
#define SF_CTRL_SF_AHB2SIF_STOPPED_MSK                          (((1U<<SF_CTRL_SF_AHB2SIF_STOPPED_LEN)-1)<<SF_CTRL_SF_AHB2SIF_STOPPED_POS)
#define SF_CTRL_SF_AHB2SIF_STOPPED_UMSK                         (~(((1U<<SF_CTRL_SF_AHB2SIF_STOPPED_LEN)-1)<<SF_CTRL_SF_AHB2SIF_STOPPED_POS))
#define SF_CTRL_SF_AHB2SIF_STOP                                 SF_CTRL_SF_AHB2SIF_STOP
#define SF_CTRL_SF_AHB2SIF_STOP_POS                             (27U)
#define SF_CTRL_SF_AHB2SIF_STOP_LEN                             (1U)
#define SF_CTRL_SF_AHB2SIF_STOP_MSK                             (((1U<<SF_CTRL_SF_AHB2SIF_STOP_LEN)-1)<<SF_CTRL_SF_AHB2SIF_STOP_POS)
#define SF_CTRL_SF_AHB2SIF_STOP_UMSK                            (~(((1U<<SF_CTRL_SF_AHB2SIF_STOP_LEN)-1)<<SF_CTRL_SF_AHB2SIF_STOP_POS))
#define SF_CTRL_SF_IF_FN_SEL                                    SF_CTRL_SF_IF_FN_SEL
#define SF_CTRL_SF_IF_FN_SEL_POS                                (28U)
#define SF_CTRL_SF_IF_FN_SEL_LEN                                (1U)
#define SF_CTRL_SF_IF_FN_SEL_MSK                                (((1U<<SF_CTRL_SF_IF_FN_SEL_LEN)-1)<<SF_CTRL_SF_IF_FN_SEL_POS)
#define SF_CTRL_SF_IF_FN_SEL_UMSK                               (~(((1U<<SF_CTRL_SF_IF_FN_SEL_LEN)-1)<<SF_CTRL_SF_IF_FN_SEL_POS))
#define SF_CTRL_SF_IF_EN                                        SF_CTRL_SF_IF_EN
#define SF_CTRL_SF_IF_EN_POS                                    (29U)
#define SF_CTRL_SF_IF_EN_LEN                                    (1U)
#define SF_CTRL_SF_IF_EN_MSK                                    (((1U<<SF_CTRL_SF_IF_EN_LEN)-1)<<SF_CTRL_SF_IF_EN_POS)
#define SF_CTRL_SF_IF_EN_UMSK                                   (~(((1U<<SF_CTRL_SF_IF_EN_LEN)-1)<<SF_CTRL_SF_IF_EN_POS))
#define SF_CTRL_SF_AHB2SIF_EN                                   SF_CTRL_SF_AHB2SIF_EN
#define SF_CTRL_SF_AHB2SIF_EN_POS                               (30U)
#define SF_CTRL_SF_AHB2SIF_EN_LEN                               (1U)
#define SF_CTRL_SF_AHB2SIF_EN_MSK                               (((1U<<SF_CTRL_SF_AHB2SIF_EN_LEN)-1)<<SF_CTRL_SF_AHB2SIF_EN_POS)
#define SF_CTRL_SF_AHB2SIF_EN_UMSK                              (~(((1U<<SF_CTRL_SF_AHB2SIF_EN_LEN)-1)<<SF_CTRL_SF_AHB2SIF_EN_POS))
#define SF_CTRL_SF_AHB2SRAM_EN                                  SF_CTRL_SF_AHB2SRAM_EN
#define SF_CTRL_SF_AHB2SRAM_EN_POS                              (31U)
#define SF_CTRL_SF_AHB2SRAM_EN_LEN                              (1U)
#define SF_CTRL_SF_AHB2SRAM_EN_MSK                              (((1U<<SF_CTRL_SF_AHB2SRAM_EN_LEN)-1)<<SF_CTRL_SF_AHB2SRAM_EN_POS)
#define SF_CTRL_SF_AHB2SRAM_EN_UMSK                             (~(((1U<<SF_CTRL_SF_AHB2SRAM_EN_LEN)-1)<<SF_CTRL_SF_AHB2SRAM_EN_POS))

