bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x8 : sf_if_sahb_0 */
#define SF_CTRL_SF_IF_SAHB_0_OFFSET                             (0x8)
#define SF_CTRL_SF_IF_BUSY                                      SF_CTRL_SF_IF_BUSY
#define SF_CTRL_SF_IF_BUSY_POS                                  (0U)
#define SF_CTRL_SF_IF_BUSY_LEN                                  (1U)
#define SF_CTRL_SF_IF_BUSY_MSK                                  (((1U<<SF_CTRL_SF_IF_BUSY_LEN)-1)<<SF_CTRL_SF_IF_BUSY_POS)
#define SF_CTRL_SF_IF_BUSY_UMSK                                 (~(((1U<<SF_CTRL_SF_IF_BUSY_LEN)-1)<<SF_CTRL_SF_IF_BUSY_POS))
#define SF_CTRL_SF_IF_0_TRIG                                    SF_CTRL_SF_IF_0_TRIG
#define SF_CTRL_SF_IF_0_TRIG_POS                                (1U)
#define SF_CTRL_SF_IF_0_TRIG_LEN                                (1U)
#define SF_CTRL_SF_IF_0_TRIG_MSK                                (((1U<<SF_CTRL_SF_IF_0_TRIG_LEN)-1)<<SF_CTRL_SF_IF_0_TRIG_POS)
#define SF_CTRL_SF_IF_0_TRIG_UMSK                               (~(((1U<<SF_CTRL_SF_IF_0_TRIG_LEN)-1)<<SF_CTRL_SF_IF_0_TRIG_POS))
#define SF_CTRL_SF_IF_0_DAT_BYTE                                SF_CTRL_SF_IF_0_DAT_BYTE
#define SF_CTRL_SF_IF_0_DAT_BYTE_POS                            (2U)
#define SF_CTRL_SF_IF_0_DAT_BYTE_LEN                            (10U)
#define SF_CTRL_SF_IF_0_DAT_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_0_DAT_BYTE_LEN)-1)<<SF_CTRL_SF_IF_0_DAT_BYTE_POS)
#define SF_CTRL_SF_IF_0_DAT_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_0_DAT_BYTE_LEN)-1)<<SF_CTRL_SF_IF_0_DAT_BYTE_POS))
#define SF_CTRL_SF_IF_0_DMY_BYTE                                SF_CTRL_SF_IF_0_DMY_BYTE
#define SF_CTRL_SF_IF_0_DMY_BYTE_POS                            (12U)
#define SF_CTRL_SF_IF_0_DMY_BYTE_LEN                            (5U)
#define SF_CTRL_SF_IF_0_DMY_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_0_DMY_BYTE_LEN)-1)<<SF_CTRL_SF_IF_0_DMY_BYTE_POS)
#define SF_CTRL_SF_IF_0_DMY_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_0_DMY_BYTE_LEN)-1)<<SF_CTRL_SF_IF_0_DMY_BYTE_POS))
#define SF_CTRL_SF_IF_0_ADR_BYTE                                SF_CTRL_SF_IF_0_ADR_BYTE
#define SF_CTRL_SF_IF_0_ADR_BYTE_POS                            (17U)
#define SF_CTRL_SF_IF_0_ADR_BYTE_LEN                            (3U)
#define SF_CTRL_SF_IF_0_ADR_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_0_ADR_BYTE_LEN)-1)<<SF_CTRL_SF_IF_0_ADR_BYTE_POS)
#define SF_CTRL_SF_IF_0_ADR_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_0_ADR_BYTE_LEN)-1)<<SF_CTRL_SF_IF_0_ADR_BYTE_POS))
#define SF_CTRL_SF_IF_0_CMD_BYTE                                SF_CTRL_SF_IF_0_CMD_BYTE
#define SF_CTRL_SF_IF_0_CMD_BYTE_POS                            (20U)
#define SF_CTRL_SF_IF_0_CMD_BYTE_LEN                            (3U)
#define SF_CTRL_SF_IF_0_CMD_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_0_CMD_BYTE_LEN)-1)<<SF_CTRL_SF_IF_0_CMD_BYTE_POS)
#define SF_CTRL_SF_IF_0_CMD_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_0_CMD_BYTE_LEN)-1)<<SF_CTRL_SF_IF_0_CMD_BYTE_POS))
#define SF_CTRL_SF_IF_0_DAT_RW                                  SF_CTRL_SF_IF_0_DAT_RW
#define SF_CTRL_SF_IF_0_DAT_RW_POS                              (23U)
#define SF_CTRL_SF_IF_0_DAT_RW_LEN                              (1U)
#define SF_CTRL_SF_IF_0_DAT_RW_MSK                              (((1U<<SF_CTRL_SF_IF_0_DAT_RW_LEN)-1)<<SF_CTRL_SF_IF_0_DAT_RW_POS)
#define SF_CTRL_SF_IF_0_DAT_RW_UMSK                             (~(((1U<<SF_CTRL_SF_IF_0_DAT_RW_LEN)-1)<<SF_CTRL_SF_IF_0_DAT_RW_POS))
#define SF_CTRL_SF_IF_0_DAT_EN                                  SF_CTRL_SF_IF_0_DAT_EN
#define SF_CTRL_SF_IF_0_DAT_EN_POS                              (24U)
#define SF_CTRL_SF_IF_0_DAT_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_0_DAT_EN_MSK                              (((1U<<SF_CTRL_SF_IF_0_DAT_EN_LEN)-1)<<SF_CTRL_SF_IF_0_DAT_EN_POS)
#define SF_CTRL_SF_IF_0_DAT_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_0_DAT_EN_LEN)-1)<<SF_CTRL_SF_IF_0_DAT_EN_POS))
#define SF_CTRL_SF_IF_0_DMY_EN                                  SF_CTRL_SF_IF_0_DMY_EN
#define SF_CTRL_SF_IF_0_DMY_EN_POS                              (25U)
#define SF_CTRL_SF_IF_0_DMY_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_0_DMY_EN_MSK                              (((1U<<SF_CTRL_SF_IF_0_DMY_EN_LEN)-1)<<SF_CTRL_SF_IF_0_DMY_EN_POS)
#define SF_CTRL_SF_IF_0_DMY_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_0_DMY_EN_LEN)-1)<<SF_CTRL_SF_IF_0_DMY_EN_POS))
#define SF_CTRL_SF_IF_0_ADR_EN                                  SF_CTRL_SF_IF_0_ADR_EN
#define SF_CTRL_SF_IF_0_ADR_EN_POS                              (26U)
#define SF_CTRL_SF_IF_0_ADR_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_0_ADR_EN_MSK                              (((1U<<SF_CTRL_SF_IF_0_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_0_ADR_EN_POS)
#define SF_CTRL_SF_IF_0_ADR_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_0_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_0_ADR_EN_POS))
#define SF_CTRL_SF_IF_0_CMD_EN                                  SF_CTRL_SF_IF_0_CMD_EN
#define SF_CTRL_SF_IF_0_CMD_EN_POS                              (27U)
#define SF_CTRL_SF_IF_0_CMD_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_0_CMD_EN_MSK                              (((1U<<SF_CTRL_SF_IF_0_CMD_EN_LEN)-1)<<SF_CTRL_SF_IF_0_CMD_EN_POS)
#define SF_CTRL_SF_IF_0_CMD_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_0_CMD_EN_LEN)-1)<<SF_CTRL_SF_IF_0_CMD_EN_POS))
#define SF_CTRL_SF_IF_0_SPI_MODE                                SF_CTRL_SF_IF_0_SPI_MODE
#define SF_CTRL_SF_IF_0_SPI_MODE_POS                            (28U)
#define SF_CTRL_SF_IF_0_SPI_MODE_LEN                            (3U)
#define SF_CTRL_SF_IF_0_SPI_MODE_MSK                            (((1U<<SF_CTRL_SF_IF_0_SPI_MODE_LEN)-1)<<SF_CTRL_SF_IF_0_SPI_MODE_POS)
#define SF_CTRL_SF_IF_0_SPI_MODE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_0_SPI_MODE_LEN)-1)<<SF_CTRL_SF_IF_0_SPI_MODE_POS))
#define SF_CTRL_SF_IF_0_QPI_MODE_EN                             SF_CTRL_SF_IF_0_QPI_MODE_EN
#define SF_CTRL_SF_IF_0_QPI_MODE_EN_POS                         (31U)
#define SF_CTRL_SF_IF_0_QPI_MODE_EN_LEN                         (1U)
#define SF_CTRL_SF_IF_0_QPI_MODE_EN_MSK                         (((1U<<SF_CTRL_SF_IF_0_QPI_MODE_EN_LEN)-1)<<SF_CTRL_SF_IF_0_QPI_MODE_EN_POS)
#define SF_CTRL_SF_IF_0_QPI_MODE_EN_UMSK                        (~(((1U<<SF_CTRL_SF_IF_0_QPI_MODE_EN_LEN)-1)<<SF_CTRL_SF_IF_0_QPI_MODE_EN_POS))

/* 0xC : sf_if_sahb_1 */
#define SF_CTRL_SF_IF_SAHB_1_OFFSET                             (0xC)
#define SF_CTRL_SF_IF_0_CMD_BUF_0                               SF_CTRL_SF_IF_0_CMD_BUF_0
#define SF_CTRL_SF_IF_0_CMD_BUF_0_POS                           (0U)
#define SF_CTRL_SF_IF_0_CMD_BUF_0_LEN                           (32U)
#define SF_CTRL_SF_IF_0_CMD_BUF_0_MSK                           (((1U<<SF_CTRL_SF_IF_0_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_0_CMD_BUF_0_POS)
#define SF_CTRL_SF_IF_0_CMD_BUF_0_UMSK                          (~(((1U<<SF_CTRL_SF_IF_0_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_0_CMD_BUF_0_POS))

/* 0x10 : sf_if_sahb_2 */
#define SF_CTRL_SF_IF_SAHB_2_OFFSET                             (0x10)
#define SF_CTRL_SF_IF_0_CMD_BUF_1                               SF_CTRL_SF_IF_0_CMD_BUF_1
#define SF_CTRL_SF_IF_0_CMD_BUF_1_POS                           (0U)
#define SF_CTRL_SF_IF_0_CMD_BUF_1_LEN                           (32U)
#define SF_CTRL_SF_IF_0_CMD_BUF_1_MSK                           (((1U<<SF_CTRL_SF_IF_0_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_0_CMD_BUF_1_POS)
#define SF_CTRL_SF_IF_0_CMD_BUF_1_UMSK                          (~(((1U<<SF_CTRL_SF_IF_0_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_0_CMD_BUF_1_POS))

/* 0x14 : sf_if_iahb_0 */
#define SF_CTRL_SF_IF_IAHB_0_OFFSET                             (0x14)
#define SF_CTRL_SF_IF_1_DMY_BYTE                                SF_CTRL_SF_IF_1_DMY_BYTE
#define SF_CTRL_SF_IF_1_DMY_BYTE_POS                            (12U)
#define SF_CTRL_SF_IF_1_DMY_BYTE_LEN                            (5U)
#define SF_CTRL_SF_IF_1_DMY_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_1_DMY_BYTE_LEN)-1)<<SF_CTRL_SF_IF_1_DMY_BYTE_POS)
#define SF_CTRL_SF_IF_1_DMY_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_1_DMY_BYTE_LEN)-1)<<SF_CTRL_SF_IF_1_DMY_BYTE_POS))
#define SF_CTRL_SF_IF_1_ADR_BYTE                                SF_CTRL_SF_IF_1_ADR_BYTE
#define SF_CTRL_SF_IF_1_ADR_BYTE_POS                            (17U)
#define SF_CTRL_SF_IF_1_ADR_BYTE_LEN                            (3U)
#define SF_CTRL_SF_IF_1_ADR_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_1_ADR_BYTE_LEN)-1)<<SF_CTRL_SF_IF_1_ADR_BYTE_POS)
#define SF_CTRL_SF_IF_1_ADR_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_1_ADR_BYTE_LEN)-1)<<SF_CTRL_SF_IF_1_ADR_BYTE_POS))
#define SF_CTRL_SF_IF_1_CMD_BYTE                                SF_CTRL_SF_IF_1_CMD_BYTE
#define SF_CTRL_SF_IF_1_CMD_BYTE_POS                            (20U)
#define SF_CTRL_SF_IF_1_CMD_BYTE_LEN                            (3U)
#define SF_CTRL_SF_IF_1_CMD_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_1_CMD_BYTE_LEN)-1)<<SF_CTRL_SF_IF_1_CMD_BYTE_POS)
#define SF_CTRL_SF_IF_1_CMD_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_1_CMD_BYTE_LEN)-1)<<SF_CTRL_SF_IF_1_CMD_BYTE_POS))
#define SF_CTRL_SF_IF_1_DAT_RW                                  SF_CTRL_SF_IF_1_DAT_RW
#define SF_CTRL_SF_IF_1_DAT_RW_POS                              (23U)
#define SF_CTRL_SF_IF_1_DAT_RW_LEN                              (1U)
#define SF_CTRL_SF_IF_1_DAT_RW_MSK                              (((1U<<SF_CTRL_SF_IF_1_DAT_RW_LEN)-1)<<SF_CTRL_SF_IF_1_DAT_RW_POS)
#define SF_CTRL_SF_IF_1_DAT_RW_UMSK                             (~(((1U<<SF_CTRL_SF_IF_1_DAT_RW_LEN)-1)<<SF_CTRL_SF_IF_1_DAT_RW_POS))
#define SF_CTRL_SF_IF_1_DAT_EN                                  SF_CTRL_SF_IF_1_DAT_EN
#define SF_CTRL_SF_IF_1_DAT_EN_POS                              (24U)
#define SF_CTRL_SF_IF_1_DAT_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_1_DAT_EN_MSK                              (((1U<<SF_CTRL_SF_IF_1_DAT_EN_LEN)-1)<<SF_CTRL_SF_IF_1_DAT_EN_POS)
#define SF_CTRL_SF_IF_1_DAT_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_1_DAT_EN_LEN)-1)<<SF_CTRL_SF_IF_1_DAT_EN_POS))
#define SF_CTRL_SF_IF_1_DMY_EN                                  SF_CTRL_SF_IF_1_DMY_EN
#define SF_CTRL_SF_IF_1_DMY_EN_POS                              (25U)
#define SF_CTRL_SF_IF_1_DMY_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_1_DMY_EN_MSK                              (((1U<<SF_CTRL_SF_IF_1_DMY_EN_LEN)-1)<<SF_CTRL_SF_IF_1_DMY_EN_POS)
#define SF_CTRL_SF_IF_1_DMY_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_1_DMY_EN_LEN)-1)<<SF_CTRL_SF_IF_1_DMY_EN_POS))
#define SF_CTRL_SF_IF_1_ADR_EN                                  SF_CTRL_SF_IF_1_ADR_EN
#define SF_CTRL_SF_IF_1_ADR_EN_POS                              (26U)
#define SF_CTRL_SF_IF_1_ADR_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_1_ADR_EN_MSK                              (((1U<<SF_CTRL_SF_IF_1_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_1_ADR_EN_POS)
#define SF_CTRL_SF_IF_1_ADR_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_1_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_1_ADR_EN_POS))
#define SF_CTRL_SF_IF_1_CMD_EN                                  SF_CTRL_SF_IF_1_CMD_EN
#define SF_CTRL_SF_IF_1_CMD_EN_POS                              (27U)
#define SF_CTRL_SF_IF_1_CMD_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_1_CMD_EN_MSK                              (((1U<<SF_CTRL_SF_IF_1_CMD_EN_LEN)-1)<<SF_CTRL_SF_IF_1_CMD_EN_POS)
#define SF_CTRL_SF_IF_1_CMD_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_1_CMD_EN_LEN)-1)<<SF_CTRL_SF_IF_1_CMD_EN_POS))
#define SF_CTRL_SF_IF_1_SPI_MODE                                SF_CTRL_SF_IF_1_SPI_MODE
#define SF_CTRL_SF_IF_1_SPI_MODE_POS                            (28U)
#define SF_CTRL_SF_IF_1_SPI_MODE_LEN                            (3U)
#define SF_CTRL_SF_IF_1_SPI_MODE_MSK                            (((1U<<SF_CTRL_SF_IF_1_SPI_MODE_LEN)-1)<<SF_CTRL_SF_IF_1_SPI_MODE_POS)
#define SF_CTRL_SF_IF_1_SPI_MODE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_1_SPI_MODE_LEN)-1)<<SF_CTRL_SF_IF_1_SPI_MODE_POS))
#define SF_CTRL_SF_IF_1_QPI_MODE_EN                             SF_CTRL_SF_IF_1_QPI_MODE_EN
#define SF_CTRL_SF_IF_1_QPI_MODE_EN_POS                         (31U)
#define SF_CTRL_SF_IF_1_QPI_MODE_EN_LEN                         (1U)
#define SF_CTRL_SF_IF_1_QPI_MODE_EN_MSK                         (((1U<<SF_CTRL_SF_IF_1_QPI_MODE_EN_LEN)-1)<<SF_CTRL_SF_IF_1_QPI_MODE_EN_POS)
#define SF_CTRL_SF_IF_1_QPI_MODE_EN_UMSK                        (~(((1U<<SF_CTRL_SF_IF_1_QPI_MODE_EN_LEN)-1)<<SF_CTRL_SF_IF_1_QPI_MODE_EN_POS))

/* 0x18 : sf_if_iahb_1 */
#define SF_CTRL_SF_IF_IAHB_1_OFFSET                             (0x18)
#define SF_CTRL_SF_IF_1_CMD_BUF_0                               SF_CTRL_SF_IF_1_CMD_BUF_0
#define SF_CTRL_SF_IF_1_CMD_BUF_0_POS                           (0U)
#define SF_CTRL_SF_IF_1_CMD_BUF_0_LEN                           (32U)
#define SF_CTRL_SF_IF_1_CMD_BUF_0_MSK                           (((1U<<SF_CTRL_SF_IF_1_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_1_CMD_BUF_0_POS)
#define SF_CTRL_SF_IF_1_CMD_BUF_0_UMSK                          (~(((1U<<SF_CTRL_SF_IF_1_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_1_CMD_BUF_0_POS))

/* 0x1C : sf_if_iahb_2 */
#define SF_CTRL_SF_IF_IAHB_2_OFFSET                             (0x1C)
#define SF_CTRL_SF_IF_1_CMD_BUF_1                               SF_CTRL_SF_IF_1_CMD_BUF_1
#define SF_CTRL_SF_IF_1_CMD_BUF_1_POS                           (0U)
#define SF_CTRL_SF_IF_1_CMD_BUF_1_LEN                           (32U)
#define SF_CTRL_SF_IF_1_CMD_BUF_1_MSK                           (((1U<<SF_CTRL_SF_IF_1_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_1_CMD_BUF_1_POS)
#define SF_CTRL_SF_IF_1_CMD_BUF_1_UMSK                          (~(((1U<<SF_CTRL_SF_IF_1_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_1_CMD_BUF_1_POS))

/* 0x20 : sf_if_status_0 */
#define SF_CTRL_SF_IF_STATUS_0_OFFSET                           (0x20)
#define SF_CTRL_SF_IF_STATUS_0                                  SF_CTRL_SF_IF_STATUS_0
#define SF_CTRL_SF_IF_STATUS_0_POS                              (0U)
#define SF_CTRL_SF_IF_STATUS_0_LEN                              (32U)
#define SF_CTRL_SF_IF_STATUS_0_MSK                              (((1U<<SF_CTRL_SF_IF_STATUS_0_LEN)-1)<<SF_CTRL_SF_IF_STATUS_0_POS)
#define SF_CTRL_SF_IF_STATUS_0_UMSK                             (~(((1U<<SF_CTRL_SF_IF_STATUS_0_LEN)-1)<<SF_CTRL_SF_IF_STATUS_0_POS))

/* 0x24 : sf_if_status_1 */
#define SF_CTRL_SF_IF_STATUS_1_OFFSET                           (0x24)
#define SF_CTRL_SF_IF_STATUS_1                                  SF_CTRL_SF_IF_STATUS_1
#define SF_CTRL_SF_IF_STATUS_1_POS                              (0U)
#define SF_CTRL_SF_IF_STATUS_1_LEN                              (32U)
#define SF_CTRL_SF_IF_STATUS_1_MSK                              (((1U<<SF_CTRL_SF_IF_STATUS_1_LEN)-1)<<SF_CTRL_SF_IF_STATUS_1_POS)
#define SF_CTRL_SF_IF_STATUS_1_UMSK                             (~(((1U<<SF_CTRL_SF_IF_STATUS_1_LEN)-1)<<SF_CTRL_SF_IF_STATUS_1_POS))

