bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x28 : sf_aes */
#define SF_CTRL_SF_AES_OFFSET                                   (0x28)
#define SF_CTRL_SF_AES_EN                                       SF_CTRL_SF_AES_EN
#define SF_CTRL_SF_AES_EN_POS                                   (0U)
#define SF_CTRL_SF_AES_EN_LEN                                   (1U)
#define SF_CTRL_SF_AES_EN_MSK                                   (((1U<<SF_CTRL_SF_AES_EN_LEN)-1)<<SF_CTRL_SF_AES_EN_POS)
#define SF_CTRL_SF_AES_EN_UMSK                                  (~(((1U<<SF_CTRL_SF_AES_EN_LEN)-1)<<SF_CTRL_SF_AES_EN_POS))
#define SF_CTRL_SF_AES_MODE                                     SF_CTRL_SF_AES_MODE
#define SF_CTRL_SF_AES_MODE_POS                                 (1U)
#define SF_CTRL_SF_AES_MODE_LEN                                 (2U)
#define SF_CTRL_SF_AES_MODE_MSK                                 (((1U<<SF_CTRL_SF_AES_MODE_LEN)-1)<<SF_CTRL_SF_AES_MODE_POS)
#define SF_CTRL_SF_AES_MODE_UMSK                                (~(((1U<<SF_CTRL_SF_AES_MODE_LEN)-1)<<SF_CTRL_SF_AES_MODE_POS))
#define SF_CTRL_SF_AES_BLK_MODE                                 SF_CTRL_SF_AES_BLK_MODE
#define SF_CTRL_SF_AES_BLK_MODE_POS                             (3U)
#define SF_CTRL_SF_AES_BLK_MODE_LEN                             (1U)
#define SF_CTRL_SF_AES_BLK_MODE_MSK                             (((1U<<SF_CTRL_SF_AES_BLK_MODE_LEN)-1)<<SF_CTRL_SF_AES_BLK_MODE_POS)
#define SF_CTRL_SF_AES_BLK_MODE_UMSK                            (~(((1U<<SF_CTRL_SF_AES_BLK_MODE_LEN)-1)<<SF_CTRL_SF_AES_BLK_MODE_POS))
#define SF_CTRL_SF_AES_XTS_KEY_OPT                              SF_CTRL_SF_AES_XTS_KEY_OPT
#define SF_CTRL_SF_AES_XTS_KEY_OPT_POS                          (4U)
#define SF_CTRL_SF_AES_XTS_KEY_OPT_LEN                          (1U)
#define SF_CTRL_SF_AES_XTS_KEY_OPT_MSK                          (((1U<<SF_CTRL_SF_AES_XTS_KEY_OPT_LEN)-1)<<SF_CTRL_SF_AES_XTS_KEY_OPT_POS)
#define SF_CTRL_SF_AES_XTS_KEY_OPT_UMSK                         (~(((1U<<SF_CTRL_SF_AES_XTS_KEY_OPT_LEN)-1)<<SF_CTRL_SF_AES_XTS_KEY_OPT_POS))
#define SF_CTRL_SF_AES_STATUS                                   SF_CTRL_SF_AES_STATUS
#define SF_CTRL_SF_AES_STATUS_POS                               (5U)
#define SF_CTRL_SF_AES_STATUS_LEN                               (27U)
#define SF_CTRL_SF_AES_STATUS_MSK                               (((1U<<SF_CTRL_SF_AES_STATUS_LEN)-1)<<SF_CTRL_SF_AES_STATUS_POS)
#define SF_CTRL_SF_AES_STATUS_UMSK                              (~(((1U<<SF_CTRL_SF_AES_STATUS_LEN)-1)<<SF_CTRL_SF_AES_STATUS_POS))

/* 0x2C : sf_ahb2sif_status */
#define SF_CTRL_SF_AHB2SIF_STATUS_OFFSET                        (0x2C)
#define SF_CTRL_SF_AHB2SIF_STATUS                               SF_CTRL_SF_AHB2SIF_STATUS
#define SF_CTRL_SF_AHB2SIF_STATUS_POS                           (0U)
#define SF_CTRL_SF_AHB2SIF_STATUS_LEN                           (32U)
#define SF_CTRL_SF_AHB2SIF_STATUS_MSK                           (((1U<<SF_CTRL_SF_AHB2SIF_STATUS_LEN)-1)<<SF_CTRL_SF_AHB2SIF_STATUS_POS)
#define SF_CTRL_SF_AHB2SIF_STATUS_UMSK                          (~(((1U<<SF_CTRL_SF_AHB2SIF_STATUS_LEN)-1)<<SF_CTRL_SF_AHB2SIF_STATUS_POS))

/* 0x30 : sf_if_io_dly_0 */
#define SF_CTRL_SF_IF_IO_DLY_0_OFFSET                           (0x30)
#define SF_CTRL_SF_CS_DLY_SEL                                   SF_CTRL_SF_CS_DLY_SEL
#define SF_CTRL_SF_CS_DLY_SEL_POS                               (0U)
#define SF_CTRL_SF_CS_DLY_SEL_LEN                               (2U)
#define SF_CTRL_SF_CS_DLY_SEL_MSK                               (((1U<<SF_CTRL_SF_CS_DLY_SEL_LEN)-1)<<SF_CTRL_SF_CS_DLY_SEL_POS)
#define SF_CTRL_SF_CS_DLY_SEL_UMSK                              (~(((1U<<SF_CTRL_SF_CS_DLY_SEL_LEN)-1)<<SF_CTRL_SF_CS_DLY_SEL_POS))
#define SF_CTRL_SF_CS2_DLY_SEL                                  SF_CTRL_SF_CS2_DLY_SEL
#define SF_CTRL_SF_CS2_DLY_SEL_POS                              (2U)
#define SF_CTRL_SF_CS2_DLY_SEL_LEN                              (2U)
#define SF_CTRL_SF_CS2_DLY_SEL_MSK                              (((1U<<SF_CTRL_SF_CS2_DLY_SEL_LEN)-1)<<SF_CTRL_SF_CS2_DLY_SEL_POS)
#define SF_CTRL_SF_CS2_DLY_SEL_UMSK                             (~(((1U<<SF_CTRL_SF_CS2_DLY_SEL_LEN)-1)<<SF_CTRL_SF_CS2_DLY_SEL_POS))
#define SF_CTRL_SF_CLK_OUT_DLY_SEL                              SF_CTRL_SF_CLK_OUT_DLY_SEL
#define SF_CTRL_SF_CLK_OUT_DLY_SEL_POS                          (8U)
#define SF_CTRL_SF_CLK_OUT_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_CLK_OUT_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_CLK_OUT_DLY_SEL_LEN)-1)<<SF_CTRL_SF_CLK_OUT_DLY_SEL_POS)
#define SF_CTRL_SF_CLK_OUT_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_CLK_OUT_DLY_SEL_LEN)-1)<<SF_CTRL_SF_CLK_OUT_DLY_SEL_POS))
#define SF_CTRL_SF_DQS_OE_DLY_SEL                               SF_CTRL_SF_DQS_OE_DLY_SEL
#define SF_CTRL_SF_DQS_OE_DLY_SEL_POS                           (26U)
#define SF_CTRL_SF_DQS_OE_DLY_SEL_LEN                           (2U)
#define SF_CTRL_SF_DQS_OE_DLY_SEL_MSK                           (((1U<<SF_CTRL_SF_DQS_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_DQS_OE_DLY_SEL_POS)
#define SF_CTRL_SF_DQS_OE_DLY_SEL_UMSK                          (~(((1U<<SF_CTRL_SF_DQS_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_DQS_OE_DLY_SEL_POS))
#define SF_CTRL_SF_DQS_DI_DLY_SEL                               SF_CTRL_SF_DQS_DI_DLY_SEL
#define SF_CTRL_SF_DQS_DI_DLY_SEL_POS                           (28U)
#define SF_CTRL_SF_DQS_DI_DLY_SEL_LEN                           (2U)
#define SF_CTRL_SF_DQS_DI_DLY_SEL_MSK                           (((1U<<SF_CTRL_SF_DQS_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_DQS_DI_DLY_SEL_POS)
#define SF_CTRL_SF_DQS_DI_DLY_SEL_UMSK                          (~(((1U<<SF_CTRL_SF_DQS_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_DQS_DI_DLY_SEL_POS))
#define SF_CTRL_SF_DQS_DO_DLY_SEL                               SF_CTRL_SF_DQS_DO_DLY_SEL
#define SF_CTRL_SF_DQS_DO_DLY_SEL_POS                           (30U)
#define SF_CTRL_SF_DQS_DO_DLY_SEL_LEN                           (2U)
#define SF_CTRL_SF_DQS_DO_DLY_SEL_MSK                           (((1U<<SF_CTRL_SF_DQS_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_DQS_DO_DLY_SEL_POS)
#define SF_CTRL_SF_DQS_DO_DLY_SEL_UMSK                          (~(((1U<<SF_CTRL_SF_DQS_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_DQS_DO_DLY_SEL_POS))

/* 0x34 : sf_if_io_dly_1 */
#define SF_CTRL_SF_IF_IO_DLY_1_OFFSET                           (0x34)
#define SF_CTRL_SF_IO_0_OE_DLY_SEL                              SF_CTRL_SF_IO_0_OE_DLY_SEL
#define SF_CTRL_SF_IO_0_OE_DLY_SEL_POS                          (0U)
#define SF_CTRL_SF_IO_0_OE_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_0_OE_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_0_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_0_OE_DLY_SEL_POS)
#define SF_CTRL_SF_IO_0_OE_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_0_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_0_OE_DLY_SEL_POS))
#define SF_CTRL_SF_IO_0_DI_DLY_SEL                              SF_CTRL_SF_IO_0_DI_DLY_SEL
#define SF_CTRL_SF_IO_0_DI_DLY_SEL_POS                          (8U)
#define SF_CTRL_SF_IO_0_DI_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_0_DI_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_0_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_0_DI_DLY_SEL_POS)
#define SF_CTRL_SF_IO_0_DI_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_0_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_0_DI_DLY_SEL_POS))
#define SF_CTRL_SF_IO_0_DO_DLY_SEL                              SF_CTRL_SF_IO_0_DO_DLY_SEL
#define SF_CTRL_SF_IO_0_DO_DLY_SEL_POS                          (16U)
#define SF_CTRL_SF_IO_0_DO_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_0_DO_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_0_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_0_DO_DLY_SEL_POS)
#define SF_CTRL_SF_IO_0_DO_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_0_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_0_DO_DLY_SEL_POS))

