bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x38 : sf_if_io_dly_2 */
#define SF_CTRL_SF_IF_IO_DLY_2_OFFSET                           (0x38)
#define SF_CTRL_SF_IO_1_OE_DLY_SEL                              SF_CTRL_SF_IO_1_OE_DLY_SEL
#define SF_CTRL_SF_IO_1_OE_DLY_SEL_POS                          (0U)
#define SF_CTRL_SF_IO_1_OE_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_1_OE_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_1_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_1_OE_DLY_SEL_POS)
#define SF_CTRL_SF_IO_1_OE_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_1_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_1_OE_DLY_SEL_POS))
#define SF_CTRL_SF_IO_1_DI_DLY_SEL                              SF_CTRL_SF_IO_1_DI_DLY_SEL
#define SF_CTRL_SF_IO_1_DI_DLY_SEL_POS                          (8U)
#define SF_CTRL_SF_IO_1_DI_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_1_DI_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_1_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_1_DI_DLY_SEL_POS)
#define SF_CTRL_SF_IO_1_DI_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_1_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_1_DI_DLY_SEL_POS))
#define SF_CTRL_SF_IO_1_DO_DLY_SEL                              SF_CTRL_SF_IO_1_DO_DLY_SEL
#define SF_CTRL_SF_IO_1_DO_DLY_SEL_POS                          (16U)
#define SF_CTRL_SF_IO_1_DO_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_1_DO_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_1_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_1_DO_DLY_SEL_POS)
#define SF_CTRL_SF_IO_1_DO_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_1_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_1_DO_DLY_SEL_POS))

/* 0x3C : sf_if_io_dly_3 */
#define SF_CTRL_SF_IF_IO_DLY_3_OFFSET                           (0x3C)
#define SF_CTRL_SF_IO_2_OE_DLY_SEL                              SF_CTRL_SF_IO_2_OE_DLY_SEL
#define SF_CTRL_SF_IO_2_OE_DLY_SEL_POS                          (0U)
#define SF_CTRL_SF_IO_2_OE_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_2_OE_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_2_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_2_OE_DLY_SEL_POS)
#define SF_CTRL_SF_IO_2_OE_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_2_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_2_OE_DLY_SEL_POS))
#define SF_CTRL_SF_IO_2_DI_DLY_SEL                              SF_CTRL_SF_IO_2_DI_DLY_SEL
#define SF_CTRL_SF_IO_2_DI_DLY_SEL_POS                          (8U)
#define SF_CTRL_SF_IO_2_DI_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_2_DI_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_2_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_2_DI_DLY_SEL_POS)
#define SF_CTRL_SF_IO_2_DI_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_2_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_2_DI_DLY_SEL_POS))
#define SF_CTRL_SF_IO_2_DO_DLY_SEL                              SF_CTRL_SF_IO_2_DO_DLY_SEL
#define SF_CTRL_SF_IO_2_DO_DLY_SEL_POS                          (16U)
#define SF_CTRL_SF_IO_2_DO_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_2_DO_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_2_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_2_DO_DLY_SEL_POS)
#define SF_CTRL_SF_IO_2_DO_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_2_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_2_DO_DLY_SEL_POS))

/* 0x40 : sf_if_io_dly_4 */
#define SF_CTRL_SF_IF_IO_DLY_4_OFFSET                           (0x40)
#define SF_CTRL_SF_IO_3_OE_DLY_SEL                              SF_CTRL_SF_IO_3_OE_DLY_SEL
#define SF_CTRL_SF_IO_3_OE_DLY_SEL_POS                          (0U)
#define SF_CTRL_SF_IO_3_OE_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_3_OE_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_3_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_3_OE_DLY_SEL_POS)
#define SF_CTRL_SF_IO_3_OE_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_3_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_3_OE_DLY_SEL_POS))
#define SF_CTRL_SF_IO_3_DI_DLY_SEL                              SF_CTRL_SF_IO_3_DI_DLY_SEL
#define SF_CTRL_SF_IO_3_DI_DLY_SEL_POS                          (8U)
#define SF_CTRL_SF_IO_3_DI_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_3_DI_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_3_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_3_DI_DLY_SEL_POS)
#define SF_CTRL_SF_IO_3_DI_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_3_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_3_DI_DLY_SEL_POS))
#define SF_CTRL_SF_IO_3_DO_DLY_SEL                              SF_CTRL_SF_IO_3_DO_DLY_SEL
#define SF_CTRL_SF_IO_3_DO_DLY_SEL_POS                          (16U)
#define SF_CTRL_SF_IO_3_DO_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF_IO_3_DO_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF_IO_3_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_3_DO_DLY_SEL_POS)
#define SF_CTRL_SF_IO_3_DO_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF_IO_3_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF_IO_3_DO_DLY_SEL_POS))

/* 0x44 : sf_reserved */
#define SF_CTRL_SF_RESERVED_OFFSET                              (0x44)
#define SF_CTRL_SF_RESERVED                                     SF_CTRL_SF_RESERVED
#define SF_CTRL_SF_RESERVED_POS                                 (0U)
#define SF_CTRL_SF_RESERVED_LEN                                 (32U)
#define SF_CTRL_SF_RESERVED_MSK                                 (((1U<<SF_CTRL_SF_RESERVED_LEN)-1)<<SF_CTRL_SF_RESERVED_POS)
#define SF_CTRL_SF_RESERVED_UMSK                                (~(((1U<<SF_CTRL_SF_RESERVED_LEN)-1)<<SF_CTRL_SF_RESERVED_POS))

/* 0x48 : sf2_if_io_dly_0 */
#define SF_CTRL_SF2_IF_IO_DLY_0_OFFSET                          (0x48)
#define SF_CTRL_SF2_CS_DLY_SEL                                  SF_CTRL_SF2_CS_DLY_SEL
#define SF_CTRL_SF2_CS_DLY_SEL_POS                              (0U)
#define SF_CTRL_SF2_CS_DLY_SEL_LEN                              (2U)
#define SF_CTRL_SF2_CS_DLY_SEL_MSK                              (((1U<<SF_CTRL_SF2_CS_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_CS_DLY_SEL_POS)
#define SF_CTRL_SF2_CS_DLY_SEL_UMSK                             (~(((1U<<SF_CTRL_SF2_CS_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_CS_DLY_SEL_POS))
#define SF_CTRL_SF2_CS2_DLY_SEL                                 SF_CTRL_SF2_CS2_DLY_SEL
#define SF_CTRL_SF2_CS2_DLY_SEL_POS                             (2U)
#define SF_CTRL_SF2_CS2_DLY_SEL_LEN                             (2U)
#define SF_CTRL_SF2_CS2_DLY_SEL_MSK                             (((1U<<SF_CTRL_SF2_CS2_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_CS2_DLY_SEL_POS)
#define SF_CTRL_SF2_CS2_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_SF2_CS2_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_CS2_DLY_SEL_POS))
#define SF_CTRL_SF2_CLK_OUT_DLY_SEL                             SF_CTRL_SF2_CLK_OUT_DLY_SEL
#define SF_CTRL_SF2_CLK_OUT_DLY_SEL_POS                         (8U)
#define SF_CTRL_SF2_CLK_OUT_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_CLK_OUT_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_CLK_OUT_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_CLK_OUT_DLY_SEL_POS)
#define SF_CTRL_SF2_CLK_OUT_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_CLK_OUT_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_CLK_OUT_DLY_SEL_POS))
#define SF_CTRL_SF2_DQS_OE_DLY_SEL                              SF_CTRL_SF2_DQS_OE_DLY_SEL
#define SF_CTRL_SF2_DQS_OE_DLY_SEL_POS                          (26U)
#define SF_CTRL_SF2_DQS_OE_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF2_DQS_OE_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF2_DQS_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_DQS_OE_DLY_SEL_POS)
#define SF_CTRL_SF2_DQS_OE_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF2_DQS_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_DQS_OE_DLY_SEL_POS))
#define SF_CTRL_SF2_DQS_DI_DLY_SEL                              SF_CTRL_SF2_DQS_DI_DLY_SEL
#define SF_CTRL_SF2_DQS_DI_DLY_SEL_POS                          (28U)
#define SF_CTRL_SF2_DQS_DI_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF2_DQS_DI_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF2_DQS_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_DQS_DI_DLY_SEL_POS)
#define SF_CTRL_SF2_DQS_DI_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF2_DQS_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_DQS_DI_DLY_SEL_POS))
#define SF_CTRL_SF2_DQS_DO_DLY_SEL                              SF_CTRL_SF2_DQS_DO_DLY_SEL
#define SF_CTRL_SF2_DQS_DO_DLY_SEL_POS                          (30U)
#define SF_CTRL_SF2_DQS_DO_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF2_DQS_DO_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF2_DQS_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_DQS_DO_DLY_SEL_POS)
#define SF_CTRL_SF2_DQS_DO_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF2_DQS_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_DQS_DO_DLY_SEL_POS))

/* 0x4C : sf2_if_io_dly_1 */
#define SF_CTRL_SF2_IF_IO_DLY_1_OFFSET                          (0x4C)
#define SF_CTRL_SF2_IO_0_OE_DLY_SEL                             SF_CTRL_SF2_IO_0_OE_DLY_SEL
#define SF_CTRL_SF2_IO_0_OE_DLY_SEL_POS                         (0U)
#define SF_CTRL_SF2_IO_0_OE_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_0_OE_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_0_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_0_OE_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_0_OE_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_0_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_0_OE_DLY_SEL_POS))
#define SF_CTRL_SF2_IO_0_DI_DLY_SEL                             SF_CTRL_SF2_IO_0_DI_DLY_SEL
#define SF_CTRL_SF2_IO_0_DI_DLY_SEL_POS                         (8U)
#define SF_CTRL_SF2_IO_0_DI_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_0_DI_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_0_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_0_DI_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_0_DI_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_0_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_0_DI_DLY_SEL_POS))
#define SF_CTRL_SF2_IO_0_DO_DLY_SEL                             SF_CTRL_SF2_IO_0_DO_DLY_SEL
#define SF_CTRL_SF2_IO_0_DO_DLY_SEL_POS                         (16U)
#define SF_CTRL_SF2_IO_0_DO_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_0_DO_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_0_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_0_DO_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_0_DO_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_0_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_0_DO_DLY_SEL_POS))

/* 0x50 : sf2_if_io_dly_2 */
#define SF_CTRL_SF2_IF_IO_DLY_2_OFFSET                          (0x50)
#define SF_CTRL_SF2_IO_1_OE_DLY_SEL                             SF_CTRL_SF2_IO_1_OE_DLY_SEL
#define SF_CTRL_SF2_IO_1_OE_DLY_SEL_POS                         (0U)
#define SF_CTRL_SF2_IO_1_OE_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_1_OE_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_1_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_1_OE_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_1_OE_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_1_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_1_OE_DLY_SEL_POS))
#define SF_CTRL_SF2_IO_1_DI_DLY_SEL                             SF_CTRL_SF2_IO_1_DI_DLY_SEL
#define SF_CTRL_SF2_IO_1_DI_DLY_SEL_POS                         (8U)
#define SF_CTRL_SF2_IO_1_DI_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_1_DI_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_1_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_1_DI_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_1_DI_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_1_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_1_DI_DLY_SEL_POS))
#define SF_CTRL_SF2_IO_1_DO_DLY_SEL                             SF_CTRL_SF2_IO_1_DO_DLY_SEL
#define SF_CTRL_SF2_IO_1_DO_DLY_SEL_POS                         (16U)
#define SF_CTRL_SF2_IO_1_DO_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_1_DO_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_1_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_1_DO_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_1_DO_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_1_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_1_DO_DLY_SEL_POS))

