bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x54 : sf2_if_io_dly_3 */
#define SF_CTRL_SF2_IF_IO_DLY_3_OFFSET                          (0x54)
#define SF_CTRL_SF2_IO_2_OE_DLY_SEL                             SF_CTRL_SF2_IO_2_OE_DLY_SEL
#define SF_CTRL_SF2_IO_2_OE_DLY_SEL_POS                         (0U)
#define SF_CTRL_SF2_IO_2_OE_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_2_OE_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_2_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_2_OE_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_2_OE_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_2_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_2_OE_DLY_SEL_POS))
#define SF_CTRL_SF2_IO_2_DI_DLY_SEL                             SF_CTRL_SF2_IO_2_DI_DLY_SEL
#define SF_CTRL_SF2_IO_2_DI_DLY_SEL_POS                         (8U)
#define SF_CTRL_SF2_IO_2_DI_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_2_DI_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_2_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_2_DI_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_2_DI_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_2_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_2_DI_DLY_SEL_POS))
#define SF_CTRL_SF2_IO_2_DO_DLY_SEL                             SF_CTRL_SF2_IO_2_DO_DLY_SEL
#define SF_CTRL_SF2_IO_2_DO_DLY_SEL_POS                         (16U)
#define SF_CTRL_SF2_IO_2_DO_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_2_DO_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_2_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_2_DO_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_2_DO_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_2_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_2_DO_DLY_SEL_POS))

/* 0x58 : sf2_if_io_dly_4 */
#define SF_CTRL_SF2_IF_IO_DLY_4_OFFSET                          (0x58)
#define SF_CTRL_SF2_IO_3_OE_DLY_SEL                             SF_CTRL_SF2_IO_3_OE_DLY_SEL
#define SF_CTRL_SF2_IO_3_OE_DLY_SEL_POS                         (0U)
#define SF_CTRL_SF2_IO_3_OE_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_3_OE_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_3_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_3_OE_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_3_OE_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_3_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_3_OE_DLY_SEL_POS))
#define SF_CTRL_SF2_IO_3_DI_DLY_SEL                             SF_CTRL_SF2_IO_3_DI_DLY_SEL
#define SF_CTRL_SF2_IO_3_DI_DLY_SEL_POS                         (8U)
#define SF_CTRL_SF2_IO_3_DI_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_3_DI_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_3_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_3_DI_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_3_DI_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_3_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_3_DI_DLY_SEL_POS))
#define SF_CTRL_SF2_IO_3_DO_DLY_SEL                             SF_CTRL_SF2_IO_3_DO_DLY_SEL
#define SF_CTRL_SF2_IO_3_DO_DLY_SEL_POS                         (16U)
#define SF_CTRL_SF2_IO_3_DO_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF2_IO_3_DO_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF2_IO_3_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_3_DO_DLY_SEL_POS)
#define SF_CTRL_SF2_IO_3_DO_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_IO_3_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF2_IO_3_DO_DLY_SEL_POS))

/* 0x5C : sf3_if_io_dly_0 */
#define SF_CTRL_SF3_IF_IO_DLY_0_OFFSET                          (0x5C)
#define SF_CTRL_SF3_CS_DLY_SEL                                  SF_CTRL_SF3_CS_DLY_SEL
#define SF_CTRL_SF3_CS_DLY_SEL_POS                              (0U)
#define SF_CTRL_SF3_CS_DLY_SEL_LEN                              (2U)
#define SF_CTRL_SF3_CS_DLY_SEL_MSK                              (((1U<<SF_CTRL_SF3_CS_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_CS_DLY_SEL_POS)
#define SF_CTRL_SF3_CS_DLY_SEL_UMSK                             (~(((1U<<SF_CTRL_SF3_CS_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_CS_DLY_SEL_POS))
#define SF_CTRL_SF3_CS2_DLY_SEL                                 SF_CTRL_SF3_CS2_DLY_SEL
#define SF_CTRL_SF3_CS2_DLY_SEL_POS                             (2U)
#define SF_CTRL_SF3_CS2_DLY_SEL_LEN                             (2U)
#define SF_CTRL_SF3_CS2_DLY_SEL_MSK                             (((1U<<SF_CTRL_SF3_CS2_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_CS2_DLY_SEL_POS)
#define SF_CTRL_SF3_CS2_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_SF3_CS2_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_CS2_DLY_SEL_POS))
#define SF_CTRL_SF3_CLK_OUT_DLY_SEL                             SF_CTRL_SF3_CLK_OUT_DLY_SEL
#define SF_CTRL_SF3_CLK_OUT_DLY_SEL_POS                         (8U)
#define SF_CTRL_SF3_CLK_OUT_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF3_CLK_OUT_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF3_CLK_OUT_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_CLK_OUT_DLY_SEL_POS)
#define SF_CTRL_SF3_CLK_OUT_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF3_CLK_OUT_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_CLK_OUT_DLY_SEL_POS))
#define SF_CTRL_SF3_DQS_OE_DLY_SEL                              SF_CTRL_SF3_DQS_OE_DLY_SEL
#define SF_CTRL_SF3_DQS_OE_DLY_SEL_POS                          (26U)
#define SF_CTRL_SF3_DQS_OE_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF3_DQS_OE_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF3_DQS_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_DQS_OE_DLY_SEL_POS)
#define SF_CTRL_SF3_DQS_OE_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF3_DQS_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_DQS_OE_DLY_SEL_POS))
#define SF_CTRL_SF3_DQS_DI_DLY_SEL                              SF_CTRL_SF3_DQS_DI_DLY_SEL
#define SF_CTRL_SF3_DQS_DI_DLY_SEL_POS                          (28U)
#define SF_CTRL_SF3_DQS_DI_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF3_DQS_DI_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF3_DQS_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_DQS_DI_DLY_SEL_POS)
#define SF_CTRL_SF3_DQS_DI_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF3_DQS_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_DQS_DI_DLY_SEL_POS))
#define SF_CTRL_SF3_DQS_DO_DLY_SEL                              SF_CTRL_SF3_DQS_DO_DLY_SEL
#define SF_CTRL_SF3_DQS_DO_DLY_SEL_POS                          (30U)
#define SF_CTRL_SF3_DQS_DO_DLY_SEL_LEN                          (2U)
#define SF_CTRL_SF3_DQS_DO_DLY_SEL_MSK                          (((1U<<SF_CTRL_SF3_DQS_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_DQS_DO_DLY_SEL_POS)
#define SF_CTRL_SF3_DQS_DO_DLY_SEL_UMSK                         (~(((1U<<SF_CTRL_SF3_DQS_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_DQS_DO_DLY_SEL_POS))

/* 0x60 : sf3_if_io_dly_1 */
#define SF_CTRL_SF3_IF_IO_DLY_1_OFFSET                          (0x60)
#define SF_CTRL_SF3_IO_0_OE_DLY_SEL                             SF_CTRL_SF3_IO_0_OE_DLY_SEL
#define SF_CTRL_SF3_IO_0_OE_DLY_SEL_POS                         (0U)
#define SF_CTRL_SF3_IO_0_OE_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF3_IO_0_OE_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF3_IO_0_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_0_OE_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_0_OE_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF3_IO_0_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_0_OE_DLY_SEL_POS))
#define SF_CTRL_SF3_IO_0_DI_DLY_SEL                             SF_CTRL_SF3_IO_0_DI_DLY_SEL
#define SF_CTRL_SF3_IO_0_DI_DLY_SEL_POS                         (8U)
#define SF_CTRL_SF3_IO_0_DI_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF3_IO_0_DI_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF3_IO_0_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_0_DI_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_0_DI_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF3_IO_0_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_0_DI_DLY_SEL_POS))
#define SF_CTRL_SF3_IO_0_DO_DLY_SEL                             SF_CTRL_SF3_IO_0_DO_DLY_SEL
#define SF_CTRL_SF3_IO_0_DO_DLY_SEL_POS                         (16U)
#define SF_CTRL_SF3_IO_0_DO_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF3_IO_0_DO_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF3_IO_0_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_0_DO_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_0_DO_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF3_IO_0_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_0_DO_DLY_SEL_POS))

/* 0x64 : sf3_if_io_dly_2 */
#define SF_CTRL_SF3_IF_IO_DLY_2_OFFSET                          (0x64)
#define SF_CTRL_SF3_IO_1_OE_DLY_SEL                             SF_CTRL_SF3_IO_1_OE_DLY_SEL
#define SF_CTRL_SF3_IO_1_OE_DLY_SEL_POS                         (0U)
#define SF_CTRL_SF3_IO_1_OE_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF3_IO_1_OE_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF3_IO_1_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_1_OE_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_1_OE_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF3_IO_1_OE_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_1_OE_DLY_SEL_POS))
#define SF_CTRL_SF3_IO_1_DI_DLY_SEL                             SF_CTRL_SF3_IO_1_DI_DLY_SEL
#define SF_CTRL_SF3_IO_1_DI_DLY_SEL_POS                         (8U)
#define SF_CTRL_SF3_IO_1_DI_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF3_IO_1_DI_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF3_IO_1_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_1_DI_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_1_DI_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF3_IO_1_DI_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_1_DI_DLY_SEL_POS))
#define SF_CTRL_SF3_IO_1_DO_DLY_SEL                             SF_CTRL_SF3_IO_1_DO_DLY_SEL
#define SF_CTRL_SF3_IO_1_DO_DLY_SEL_POS                         (16U)
#define SF_CTRL_SF3_IO_1_DO_DLY_SEL_LEN                         (2U)
#define SF_CTRL_SF3_IO_1_DO_DLY_SEL_MSK                         (((1U<<SF_CTRL_SF3_IO_1_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_1_DO_DLY_SEL_POS)
#define SF_CTRL_SF3_IO_1_DO_DLY_SEL_UMSK                        (~(((1U<<SF_CTRL_SF3_IO_1_DO_DLY_SEL_LEN)-1)<<SF_CTRL_SF3_IO_1_DO_DLY_SEL_POS))

