bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x7C : sf_if_iahb_4 */
#define SF_CTRL_SF_IF_IAHB_4_OFFSET                             (0x7C)
#define SF_CTRL_SF_IF_2_CMD_BUF_0                               SF_CTRL_SF_IF_2_CMD_BUF_0
#define SF_CTRL_SF_IF_2_CMD_BUF_0_POS                           (0U)
#define SF_CTRL_SF_IF_2_CMD_BUF_0_LEN                           (32U)
#define SF_CTRL_SF_IF_2_CMD_BUF_0_MSK                           (((1U<<SF_CTRL_SF_IF_2_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_2_CMD_BUF_0_POS)
#define SF_CTRL_SF_IF_2_CMD_BUF_0_UMSK                          (~(((1U<<SF_CTRL_SF_IF_2_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_2_CMD_BUF_0_POS))

/* 0x80 : sf_if_iahb_5 */
#define SF_CTRL_SF_IF_IAHB_5_OFFSET                             (0x80)
#define SF_CTRL_SF_IF_2_CMD_BUF_1                               SF_CTRL_SF_IF_2_CMD_BUF_1
#define SF_CTRL_SF_IF_2_CMD_BUF_1_POS                           (0U)
#define SF_CTRL_SF_IF_2_CMD_BUF_1_LEN                           (32U)
#define SF_CTRL_SF_IF_2_CMD_BUF_1_MSK                           (((1U<<SF_CTRL_SF_IF_2_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_2_CMD_BUF_1_POS)
#define SF_CTRL_SF_IF_2_CMD_BUF_1_UMSK                          (~(((1U<<SF_CTRL_SF_IF_2_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_2_CMD_BUF_1_POS))

/* 0x84 : sf_if_iahb_6 */
#define SF_CTRL_SF_IF_IAHB_6_OFFSET                             (0x84)
#define SF_CTRL_SF_IF_3_ADR_BYTE                                SF_CTRL_SF_IF_3_ADR_BYTE
#define SF_CTRL_SF_IF_3_ADR_BYTE_POS                            (17U)
#define SF_CTRL_SF_IF_3_ADR_BYTE_LEN                            (3U)
#define SF_CTRL_SF_IF_3_ADR_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_3_ADR_BYTE_LEN)-1)<<SF_CTRL_SF_IF_3_ADR_BYTE_POS)
#define SF_CTRL_SF_IF_3_ADR_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_3_ADR_BYTE_LEN)-1)<<SF_CTRL_SF_IF_3_ADR_BYTE_POS))
#define SF_CTRL_SF_IF_3_CMD_BYTE                                SF_CTRL_SF_IF_3_CMD_BYTE
#define SF_CTRL_SF_IF_3_CMD_BYTE_POS                            (20U)
#define SF_CTRL_SF_IF_3_CMD_BYTE_LEN                            (3U)
#define SF_CTRL_SF_IF_3_CMD_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_3_CMD_BYTE_LEN)-1)<<SF_CTRL_SF_IF_3_CMD_BYTE_POS)
#define SF_CTRL_SF_IF_3_CMD_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_3_CMD_BYTE_LEN)-1)<<SF_CTRL_SF_IF_3_CMD_BYTE_POS))
#define SF_CTRL_SF_IF_3_ADR_EN                                  SF_CTRL_SF_IF_3_ADR_EN
#define SF_CTRL_SF_IF_3_ADR_EN_POS                              (26U)
#define SF_CTRL_SF_IF_3_ADR_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_3_ADR_EN_MSK                              (((1U<<SF_CTRL_SF_IF_3_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_3_ADR_EN_POS)
#define SF_CTRL_SF_IF_3_ADR_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_3_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_3_ADR_EN_POS))
#define SF_CTRL_SF_IF_3_CMD_EN                                  SF_CTRL_SF_IF_3_CMD_EN
#define SF_CTRL_SF_IF_3_CMD_EN_POS                              (27U)
#define SF_CTRL_SF_IF_3_CMD_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_3_CMD_EN_MSK                              (((1U<<SF_CTRL_SF_IF_3_CMD_EN_LEN)-1)<<SF_CTRL_SF_IF_3_CMD_EN_POS)
#define SF_CTRL_SF_IF_3_CMD_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_3_CMD_EN_LEN)-1)<<SF_CTRL_SF_IF_3_CMD_EN_POS))
#define SF_CTRL_SF_IF_3_SPI_MODE                                SF_CTRL_SF_IF_3_SPI_MODE
#define SF_CTRL_SF_IF_3_SPI_MODE_POS                            (28U)
#define SF_CTRL_SF_IF_3_SPI_MODE_LEN                            (3U)
#define SF_CTRL_SF_IF_3_SPI_MODE_MSK                            (((1U<<SF_CTRL_SF_IF_3_SPI_MODE_LEN)-1)<<SF_CTRL_SF_IF_3_SPI_MODE_POS)
#define SF_CTRL_SF_IF_3_SPI_MODE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_3_SPI_MODE_LEN)-1)<<SF_CTRL_SF_IF_3_SPI_MODE_POS))
#define SF_CTRL_SF_IF_3_QPI_MODE_EN                             SF_CTRL_SF_IF_3_QPI_MODE_EN
#define SF_CTRL_SF_IF_3_QPI_MODE_EN_POS                         (31U)
#define SF_CTRL_SF_IF_3_QPI_MODE_EN_LEN                         (1U)
#define SF_CTRL_SF_IF_3_QPI_MODE_EN_MSK                         (((1U<<SF_CTRL_SF_IF_3_QPI_MODE_EN_LEN)-1)<<SF_CTRL_SF_IF_3_QPI_MODE_EN_POS)
#define SF_CTRL_SF_IF_3_QPI_MODE_EN_UMSK                        (~(((1U<<SF_CTRL_SF_IF_3_QPI_MODE_EN_LEN)-1)<<SF_CTRL_SF_IF_3_QPI_MODE_EN_POS))

/* 0x88 : sf_if_iahb_7 */
#define SF_CTRL_SF_IF_IAHB_7_OFFSET                             (0x88)
#define SF_CTRL_SF_IF_3_CMD_BUF_0                               SF_CTRL_SF_IF_3_CMD_BUF_0
#define SF_CTRL_SF_IF_3_CMD_BUF_0_POS                           (0U)
#define SF_CTRL_SF_IF_3_CMD_BUF_0_LEN                           (32U)
#define SF_CTRL_SF_IF_3_CMD_BUF_0_MSK                           (((1U<<SF_CTRL_SF_IF_3_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_3_CMD_BUF_0_POS)
#define SF_CTRL_SF_IF_3_CMD_BUF_0_UMSK                          (~(((1U<<SF_CTRL_SF_IF_3_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_3_CMD_BUF_0_POS))

/* 0x8C : sf_if_iahb_8 */
#define SF_CTRL_SF_IF_IAHB_8_OFFSET                             (0x8C)
#define SF_CTRL_SF_IF_3_CMD_BUF_1                               SF_CTRL_SF_IF_3_CMD_BUF_1
#define SF_CTRL_SF_IF_3_CMD_BUF_1_POS                           (0U)
#define SF_CTRL_SF_IF_3_CMD_BUF_1_LEN                           (32U)
#define SF_CTRL_SF_IF_3_CMD_BUF_1_MSK                           (((1U<<SF_CTRL_SF_IF_3_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_3_CMD_BUF_1_POS)
#define SF_CTRL_SF_IF_3_CMD_BUF_1_UMSK                          (~(((1U<<SF_CTRL_SF_IF_3_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_3_CMD_BUF_1_POS))

/* 0x90 : sf_if_iahb_9 */
#define SF_CTRL_SF_IF_IAHB_9_OFFSET                             (0x90)
#define SF_CTRL_SF_IF_4_DMY_BYTE                                SF_CTRL_SF_IF_4_DMY_BYTE
#define SF_CTRL_SF_IF_4_DMY_BYTE_POS                            (12U)
#define SF_CTRL_SF_IF_4_DMY_BYTE_LEN                            (5U)
#define SF_CTRL_SF_IF_4_DMY_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_4_DMY_BYTE_LEN)-1)<<SF_CTRL_SF_IF_4_DMY_BYTE_POS)
#define SF_CTRL_SF_IF_4_DMY_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_4_DMY_BYTE_LEN)-1)<<SF_CTRL_SF_IF_4_DMY_BYTE_POS))
#define SF_CTRL_SF_IF_4_ADR_BYTE                                SF_CTRL_SF_IF_4_ADR_BYTE
#define SF_CTRL_SF_IF_4_ADR_BYTE_POS                            (17U)
#define SF_CTRL_SF_IF_4_ADR_BYTE_LEN                            (3U)
#define SF_CTRL_SF_IF_4_ADR_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_4_ADR_BYTE_LEN)-1)<<SF_CTRL_SF_IF_4_ADR_BYTE_POS)
#define SF_CTRL_SF_IF_4_ADR_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_4_ADR_BYTE_LEN)-1)<<SF_CTRL_SF_IF_4_ADR_BYTE_POS))
#define SF_CTRL_SF_IF_4_CMD_BYTE                                SF_CTRL_SF_IF_4_CMD_BYTE
#define SF_CTRL_SF_IF_4_CMD_BYTE_POS                            (20U)
#define SF_CTRL_SF_IF_4_CMD_BYTE_LEN                            (3U)
#define SF_CTRL_SF_IF_4_CMD_BYTE_MSK                            (((1U<<SF_CTRL_SF_IF_4_CMD_BYTE_LEN)-1)<<SF_CTRL_SF_IF_4_CMD_BYTE_POS)
#define SF_CTRL_SF_IF_4_CMD_BYTE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_4_CMD_BYTE_LEN)-1)<<SF_CTRL_SF_IF_4_CMD_BYTE_POS))
#define SF_CTRL_SF_IF_4_DAT_RW                                  SF_CTRL_SF_IF_4_DAT_RW
#define SF_CTRL_SF_IF_4_DAT_RW_POS                              (23U)
#define SF_CTRL_SF_IF_4_DAT_RW_LEN                              (1U)
#define SF_CTRL_SF_IF_4_DAT_RW_MSK                              (((1U<<SF_CTRL_SF_IF_4_DAT_RW_LEN)-1)<<SF_CTRL_SF_IF_4_DAT_RW_POS)
#define SF_CTRL_SF_IF_4_DAT_RW_UMSK                             (~(((1U<<SF_CTRL_SF_IF_4_DAT_RW_LEN)-1)<<SF_CTRL_SF_IF_4_DAT_RW_POS))
#define SF_CTRL_SF_IF_4_DAT_EN                                  SF_CTRL_SF_IF_4_DAT_EN
#define SF_CTRL_SF_IF_4_DAT_EN_POS                              (24U)
#define SF_CTRL_SF_IF_4_DAT_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_4_DAT_EN_MSK                              (((1U<<SF_CTRL_SF_IF_4_DAT_EN_LEN)-1)<<SF_CTRL_SF_IF_4_DAT_EN_POS)
#define SF_CTRL_SF_IF_4_DAT_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_4_DAT_EN_LEN)-1)<<SF_CTRL_SF_IF_4_DAT_EN_POS))
#define SF_CTRL_SF_IF_4_DMY_EN                                  SF_CTRL_SF_IF_4_DMY_EN
#define SF_CTRL_SF_IF_4_DMY_EN_POS                              (25U)
#define SF_CTRL_SF_IF_4_DMY_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_4_DMY_EN_MSK                              (((1U<<SF_CTRL_SF_IF_4_DMY_EN_LEN)-1)<<SF_CTRL_SF_IF_4_DMY_EN_POS)
#define SF_CTRL_SF_IF_4_DMY_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_4_DMY_EN_LEN)-1)<<SF_CTRL_SF_IF_4_DMY_EN_POS))
#define SF_CTRL_SF_IF_4_ADR_EN                                  SF_CTRL_SF_IF_4_ADR_EN
#define SF_CTRL_SF_IF_4_ADR_EN_POS                              (26U)
#define SF_CTRL_SF_IF_4_ADR_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_4_ADR_EN_MSK                              (((1U<<SF_CTRL_SF_IF_4_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_4_ADR_EN_POS)
#define SF_CTRL_SF_IF_4_ADR_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_4_ADR_EN_LEN)-1)<<SF_CTRL_SF_IF_4_ADR_EN_POS))
#define SF_CTRL_SF_IF_4_CMD_EN                                  SF_CTRL_SF_IF_4_CMD_EN
#define SF_CTRL_SF_IF_4_CMD_EN_POS                              (27U)
#define SF_CTRL_SF_IF_4_CMD_EN_LEN                              (1U)
#define SF_CTRL_SF_IF_4_CMD_EN_MSK                              (((1U<<SF_CTRL_SF_IF_4_CMD_EN_LEN)-1)<<SF_CTRL_SF_IF_4_CMD_EN_POS)
#define SF_CTRL_SF_IF_4_CMD_EN_UMSK                             (~(((1U<<SF_CTRL_SF_IF_4_CMD_EN_LEN)-1)<<SF_CTRL_SF_IF_4_CMD_EN_POS))
#define SF_CTRL_SF_IF_4_SPI_MODE                                SF_CTRL_SF_IF_4_SPI_MODE
#define SF_CTRL_SF_IF_4_SPI_MODE_POS                            (28U)
#define SF_CTRL_SF_IF_4_SPI_MODE_LEN                            (3U)
#define SF_CTRL_SF_IF_4_SPI_MODE_MSK                            (((1U<<SF_CTRL_SF_IF_4_SPI_MODE_LEN)-1)<<SF_CTRL_SF_IF_4_SPI_MODE_POS)
#define SF_CTRL_SF_IF_4_SPI_MODE_UMSK                           (~(((1U<<SF_CTRL_SF_IF_4_SPI_MODE_LEN)-1)<<SF_CTRL_SF_IF_4_SPI_MODE_POS))
#define SF_CTRL_SF_IF_4_QPI_MODE_EN                             SF_CTRL_SF_IF_4_QPI_MODE_EN
#define SF_CTRL_SF_IF_4_QPI_MODE_EN_POS                         (31U)
#define SF_CTRL_SF_IF_4_QPI_MODE_EN_LEN                         (1U)
#define SF_CTRL_SF_IF_4_QPI_MODE_EN_MSK                         (((1U<<SF_CTRL_SF_IF_4_QPI_MODE_EN_LEN)-1)<<SF_CTRL_SF_IF_4_QPI_MODE_EN_POS)
#define SF_CTRL_SF_IF_4_QPI_MODE_EN_UMSK                        (~(((1U<<SF_CTRL_SF_IF_4_QPI_MODE_EN_LEN)-1)<<SF_CTRL_SF_IF_4_QPI_MODE_EN_POS))

