bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x94 : sf_if_iahb_10 */
#define SF_CTRL_SF_IF_IAHB_10_OFFSET                            (0x94)
#define SF_CTRL_SF_IF_4_CMD_BUF_0                               SF_CTRL_SF_IF_4_CMD_BUF_0
#define SF_CTRL_SF_IF_4_CMD_BUF_0_POS                           (0U)
#define SF_CTRL_SF_IF_4_CMD_BUF_0_LEN                           (32U)
#define SF_CTRL_SF_IF_4_CMD_BUF_0_MSK                           (((1U<<SF_CTRL_SF_IF_4_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_4_CMD_BUF_0_POS)
#define SF_CTRL_SF_IF_4_CMD_BUF_0_UMSK                          (~(((1U<<SF_CTRL_SF_IF_4_CMD_BUF_0_LEN)-1)<<SF_CTRL_SF_IF_4_CMD_BUF_0_POS))

/* 0x98 : sf_if_iahb_11 */
#define SF_CTRL_SF_IF_IAHB_11_OFFSET                            (0x98)
#define SF_CTRL_SF_IF_4_CMD_BUF_1                               SF_CTRL_SF_IF_4_CMD_BUF_1
#define SF_CTRL_SF_IF_4_CMD_BUF_1_POS                           (0U)
#define SF_CTRL_SF_IF_4_CMD_BUF_1_LEN                           (32U)
#define SF_CTRL_SF_IF_4_CMD_BUF_1_MSK                           (((1U<<SF_CTRL_SF_IF_4_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_4_CMD_BUF_1_POS)
#define SF_CTRL_SF_IF_4_CMD_BUF_1_UMSK                          (~(((1U<<SF_CTRL_SF_IF_4_CMD_BUF_1_LEN)-1)<<SF_CTRL_SF_IF_4_CMD_BUF_1_POS))

/* 0x9C : sf_if_iahb_12 */
#define SF_CTRL_SF_IF_IAHB_12_OFFSET                            (0x9C)
#define SF_CTRL_SF2_CLK_SF_RX_INV_SEL                           SF_CTRL_SF2_CLK_SF_RX_INV_SEL
#define SF_CTRL_SF2_CLK_SF_RX_INV_SEL_POS                       (2U)
#define SF_CTRL_SF2_CLK_SF_RX_INV_SEL_LEN                       (1U)
#define SF_CTRL_SF2_CLK_SF_RX_INV_SEL_MSK                       (((1U<<SF_CTRL_SF2_CLK_SF_RX_INV_SEL_LEN)-1)<<SF_CTRL_SF2_CLK_SF_RX_INV_SEL_POS)
#define SF_CTRL_SF2_CLK_SF_RX_INV_SEL_UMSK                      (~(((1U<<SF_CTRL_SF2_CLK_SF_RX_INV_SEL_LEN)-1)<<SF_CTRL_SF2_CLK_SF_RX_INV_SEL_POS))
#define SF_CTRL_SF2_CLK_SF_RX_INV_SRC                           SF_CTRL_SF2_CLK_SF_RX_INV_SRC
#define SF_CTRL_SF2_CLK_SF_RX_INV_SRC_POS                       (3U)
#define SF_CTRL_SF2_CLK_SF_RX_INV_SRC_LEN                       (1U)
#define SF_CTRL_SF2_CLK_SF_RX_INV_SRC_MSK                       (((1U<<SF_CTRL_SF2_CLK_SF_RX_INV_SRC_LEN)-1)<<SF_CTRL_SF2_CLK_SF_RX_INV_SRC_POS)
#define SF_CTRL_SF2_CLK_SF_RX_INV_SRC_UMSK                      (~(((1U<<SF_CTRL_SF2_CLK_SF_RX_INV_SRC_LEN)-1)<<SF_CTRL_SF2_CLK_SF_RX_INV_SRC_POS))
#define SF_CTRL_SF2_CLK_OUT_INV_SEL                             SF_CTRL_SF2_CLK_OUT_INV_SEL
#define SF_CTRL_SF2_CLK_OUT_INV_SEL_POS                         (4U)
#define SF_CTRL_SF2_CLK_OUT_INV_SEL_LEN                         (1U)
#define SF_CTRL_SF2_CLK_OUT_INV_SEL_MSK                         (((1U<<SF_CTRL_SF2_CLK_OUT_INV_SEL_LEN)-1)<<SF_CTRL_SF2_CLK_OUT_INV_SEL_POS)
#define SF_CTRL_SF2_CLK_OUT_INV_SEL_UMSK                        (~(((1U<<SF_CTRL_SF2_CLK_OUT_INV_SEL_LEN)-1)<<SF_CTRL_SF2_CLK_OUT_INV_SEL_POS))
#define SF_CTRL_SF3_CLK_OUT_INV_SEL                             SF_CTRL_SF3_CLK_OUT_INV_SEL
#define SF_CTRL_SF3_CLK_OUT_INV_SEL_POS                         (5U)
#define SF_CTRL_SF3_CLK_OUT_INV_SEL_LEN                         (1U)
#define SF_CTRL_SF3_CLK_OUT_INV_SEL_MSK                         (((1U<<SF_CTRL_SF3_CLK_OUT_INV_SEL_LEN)-1)<<SF_CTRL_SF3_CLK_OUT_INV_SEL_POS)
#define SF_CTRL_SF3_CLK_OUT_INV_SEL_UMSK                        (~(((1U<<SF_CTRL_SF3_CLK_OUT_INV_SEL_LEN)-1)<<SF_CTRL_SF3_CLK_OUT_INV_SEL_POS))
#define SF_CTRL_SF2_IF_READ_DLY_N                               SF_CTRL_SF2_IF_READ_DLY_N
#define SF_CTRL_SF2_IF_READ_DLY_N_POS                           (8U)
#define SF_CTRL_SF2_IF_READ_DLY_N_LEN                           (3U)
#define SF_CTRL_SF2_IF_READ_DLY_N_MSK                           (((1U<<SF_CTRL_SF2_IF_READ_DLY_N_LEN)-1)<<SF_CTRL_SF2_IF_READ_DLY_N_POS)
#define SF_CTRL_SF2_IF_READ_DLY_N_UMSK                          (~(((1U<<SF_CTRL_SF2_IF_READ_DLY_N_LEN)-1)<<SF_CTRL_SF2_IF_READ_DLY_N_POS))
#define SF_CTRL_SF2_IF_READ_DLY_EN                              SF_CTRL_SF2_IF_READ_DLY_EN
#define SF_CTRL_SF2_IF_READ_DLY_EN_POS                          (11U)
#define SF_CTRL_SF2_IF_READ_DLY_EN_LEN                          (1U)
#define SF_CTRL_SF2_IF_READ_DLY_EN_MSK                          (((1U<<SF_CTRL_SF2_IF_READ_DLY_EN_LEN)-1)<<SF_CTRL_SF2_IF_READ_DLY_EN_POS)
#define SF_CTRL_SF2_IF_READ_DLY_EN_UMSK                         (~(((1U<<SF_CTRL_SF2_IF_READ_DLY_EN_LEN)-1)<<SF_CTRL_SF2_IF_READ_DLY_EN_POS))
#define SF_CTRL_SF2_IF_READ_DLY_SRC                             SF_CTRL_SF2_IF_READ_DLY_SRC
#define SF_CTRL_SF2_IF_READ_DLY_SRC_POS                         (12U)
#define SF_CTRL_SF2_IF_READ_DLY_SRC_LEN                         (1U)
#define SF_CTRL_SF2_IF_READ_DLY_SRC_MSK                         (((1U<<SF_CTRL_SF2_IF_READ_DLY_SRC_LEN)-1)<<SF_CTRL_SF2_IF_READ_DLY_SRC_POS)
#define SF_CTRL_SF2_IF_READ_DLY_SRC_UMSK                        (~(((1U<<SF_CTRL_SF2_IF_READ_DLY_SRC_LEN)-1)<<SF_CTRL_SF2_IF_READ_DLY_SRC_POS))

/* 0xA0 : sf_id0_offset */
#define SF_CTRL_SF_ID0_OFFSET_OFFSET                            (0xA0)
#define SF_CTRL_SF_ID0_OFFSET                                   SF_CTRL_SF_ID0_OFFSET
#define SF_CTRL_SF_ID0_OFFSET_POS                               (0U)
#define SF_CTRL_SF_ID0_OFFSET_LEN                               (28U)
#define SF_CTRL_SF_ID0_OFFSET_MSK                               (((1U<<SF_CTRL_SF_ID0_OFFSET_LEN)-1)<<SF_CTRL_SF_ID0_OFFSET_POS)
#define SF_CTRL_SF_ID0_OFFSET_UMSK                              (~(((1U<<SF_CTRL_SF_ID0_OFFSET_LEN)-1)<<SF_CTRL_SF_ID0_OFFSET_POS))

/* 0xA4 : sf_id1_offset */
#define SF_CTRL_SF_ID1_OFFSET_OFFSET                            (0xA4)
#define SF_CTRL_SF_ID1_OFFSET                                   SF_CTRL_SF_ID1_OFFSET
#define SF_CTRL_SF_ID1_OFFSET_POS                               (0U)
#define SF_CTRL_SF_ID1_OFFSET_LEN                               (28U)
#define SF_CTRL_SF_ID1_OFFSET_MSK                               (((1U<<SF_CTRL_SF_ID1_OFFSET_LEN)-1)<<SF_CTRL_SF_ID1_OFFSET_POS)
#define SF_CTRL_SF_ID1_OFFSET_UMSK                              (~(((1U<<SF_CTRL_SF_ID1_OFFSET_LEN)-1)<<SF_CTRL_SF_ID1_OFFSET_POS))

/* 0xA8 : sf_bk2_id0_offset */
#define SF_CTRL_SF_BK2_ID0_OFFSET_OFFSET                        (0xA8)
#define SF_CTRL_SF_BK2_ID0_OFFSET                               SF_CTRL_SF_BK2_ID0_OFFSET
#define SF_CTRL_SF_BK2_ID0_OFFSET_POS                           (0U)
#define SF_CTRL_SF_BK2_ID0_OFFSET_LEN                           (28U)
#define SF_CTRL_SF_BK2_ID0_OFFSET_MSK                           (((1U<<SF_CTRL_SF_BK2_ID0_OFFSET_LEN)-1)<<SF_CTRL_SF_BK2_ID0_OFFSET_POS)
#define SF_CTRL_SF_BK2_ID0_OFFSET_UMSK                          (~(((1U<<SF_CTRL_SF_BK2_ID0_OFFSET_LEN)-1)<<SF_CTRL_SF_BK2_ID0_OFFSET_POS))

/* 0xAC : sf_bk2_id1_offset */
#define SF_CTRL_SF_BK2_ID1_OFFSET_OFFSET                        (0xAC)
#define SF_CTRL_SF_BK2_ID1_OFFSET                               SF_CTRL_SF_BK2_ID1_OFFSET
#define SF_CTRL_SF_BK2_ID1_OFFSET_POS                           (0U)
#define SF_CTRL_SF_BK2_ID1_OFFSET_LEN                           (28U)
#define SF_CTRL_SF_BK2_ID1_OFFSET_MSK                           (((1U<<SF_CTRL_SF_BK2_ID1_OFFSET_LEN)-1)<<SF_CTRL_SF_BK2_ID1_OFFSET_POS)
#define SF_CTRL_SF_BK2_ID1_OFFSET_UMSK                          (~(((1U<<SF_CTRL_SF_BK2_ID1_OFFSET_LEN)-1)<<SF_CTRL_SF_BK2_ID1_OFFSET_POS))

/* 0xB0 : sf_dbg */
#define SF_CTRL_SF_DBG_OFFSET                                   (0xB0)
#define SF_CTRL_SF_AUTOLOAD_ST                                  SF_CTRL_SF_AUTOLOAD_ST
#define SF_CTRL_SF_AUTOLOAD_ST_POS                              (0U)
#define SF_CTRL_SF_AUTOLOAD_ST_LEN                              (5U)
#define SF_CTRL_SF_AUTOLOAD_ST_MSK                              (((1U<<SF_CTRL_SF_AUTOLOAD_ST_LEN)-1)<<SF_CTRL_SF_AUTOLOAD_ST_POS)
#define SF_CTRL_SF_AUTOLOAD_ST_UMSK                             (~(((1U<<SF_CTRL_SF_AUTOLOAD_ST_LEN)-1)<<SF_CTRL_SF_AUTOLOAD_ST_POS))
#define SF_CTRL_SF_AUTOLOAD_ST_DONE                             SF_CTRL_SF_AUTOLOAD_ST_DONE
#define SF_CTRL_SF_AUTOLOAD_ST_DONE_POS                         (5U)
#define SF_CTRL_SF_AUTOLOAD_ST_DONE_LEN                         (1U)
#define SF_CTRL_SF_AUTOLOAD_ST_DONE_MSK                         (((1U<<SF_CTRL_SF_AUTOLOAD_ST_DONE_LEN)-1)<<SF_CTRL_SF_AUTOLOAD_ST_DONE_POS)
#define SF_CTRL_SF_AUTOLOAD_ST_DONE_UMSK                        (~(((1U<<SF_CTRL_SF_AUTOLOAD_ST_DONE_LEN)-1)<<SF_CTRL_SF_AUTOLOAD_ST_DONE_POS))

