bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x214 : sf_aes_key_r0_5 */
#define SF_CTRL_SF_AES_KEY_R0_5_OFFSET                          (0x214)
#define SF_CTRL_SF_AES_KEY_R0_5                                 SF_CTRL_SF_AES_KEY_R0_5
#define SF_CTRL_SF_AES_KEY_R0_5_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R0_5_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R0_5_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R0_5_LEN)-1)<<SF_CTRL_SF_AES_KEY_R0_5_POS)
#define SF_CTRL_SF_AES_KEY_R0_5_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R0_5_LEN)-1)<<SF_CTRL_SF_AES_KEY_R0_5_POS))

/* 0x218 : sf_aes_key_r0_6 */
#define SF_CTRL_SF_AES_KEY_R0_6_OFFSET                          (0x218)
#define SF_CTRL_SF_AES_KEY_R0_6                                 SF_CTRL_SF_AES_KEY_R0_6
#define SF_CTRL_SF_AES_KEY_R0_6_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R0_6_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R0_6_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R0_6_LEN)-1)<<SF_CTRL_SF_AES_KEY_R0_6_POS)
#define SF_CTRL_SF_AES_KEY_R0_6_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R0_6_LEN)-1)<<SF_CTRL_SF_AES_KEY_R0_6_POS))

/* 0x21C : sf_aes_key_r0_7 */
#define SF_CTRL_SF_AES_KEY_R0_7_OFFSET                          (0x21C)
#define SF_CTRL_SF_AES_KEY_R0_7                                 SF_CTRL_SF_AES_KEY_R0_7
#define SF_CTRL_SF_AES_KEY_R0_7_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R0_7_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R0_7_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R0_7_LEN)-1)<<SF_CTRL_SF_AES_KEY_R0_7_POS)
#define SF_CTRL_SF_AES_KEY_R0_7_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R0_7_LEN)-1)<<SF_CTRL_SF_AES_KEY_R0_7_POS))

/* 0x220 : sf_aes_iv_r0_w0 */
#define SF_CTRL_SF_AES_IV_R0_W0_OFFSET                          (0x220)
#define SF_CTRL_SF_AES_IV_R0_W0                                 SF_CTRL_SF_AES_IV_R0_W0
#define SF_CTRL_SF_AES_IV_R0_W0_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R0_W0_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R0_W0_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R0_W0_LEN)-1)<<SF_CTRL_SF_AES_IV_R0_W0_POS)
#define SF_CTRL_SF_AES_IV_R0_W0_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R0_W0_LEN)-1)<<SF_CTRL_SF_AES_IV_R0_W0_POS))

/* 0x224 : sf_aes_iv_r0_w1 */
#define SF_CTRL_SF_AES_IV_R0_W1_OFFSET                          (0x224)
#define SF_CTRL_SF_AES_IV_R0_W1                                 SF_CTRL_SF_AES_IV_R0_W1
#define SF_CTRL_SF_AES_IV_R0_W1_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R0_W1_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R0_W1_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R0_W1_LEN)-1)<<SF_CTRL_SF_AES_IV_R0_W1_POS)
#define SF_CTRL_SF_AES_IV_R0_W1_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R0_W1_LEN)-1)<<SF_CTRL_SF_AES_IV_R0_W1_POS))

/* 0x228 : sf_aes_iv_r0_w2 */
#define SF_CTRL_SF_AES_IV_R0_W2_OFFSET                          (0x228)
#define SF_CTRL_SF_AES_IV_R0_W2                                 SF_CTRL_SF_AES_IV_R0_W2
#define SF_CTRL_SF_AES_IV_R0_W2_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R0_W2_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R0_W2_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R0_W2_LEN)-1)<<SF_CTRL_SF_AES_IV_R0_W2_POS)
#define SF_CTRL_SF_AES_IV_R0_W2_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R0_W2_LEN)-1)<<SF_CTRL_SF_AES_IV_R0_W2_POS))

/* 0x22C : sf_aes_iv_r0_w3 */
#define SF_CTRL_SF_AES_IV_R0_W3_OFFSET                          (0x22C)
#define SF_CTRL_SF_AES_IV_R0_W3                                 SF_CTRL_SF_AES_IV_R0_W3
#define SF_CTRL_SF_AES_IV_R0_W3_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R0_W3_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R0_W3_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R0_W3_LEN)-1)<<SF_CTRL_SF_AES_IV_R0_W3_POS)
#define SF_CTRL_SF_AES_IV_R0_W3_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R0_W3_LEN)-1)<<SF_CTRL_SF_AES_IV_R0_W3_POS))

/* 0x230 : sf_aes_r0_start */
#define SF_CTRL_SF_AES_R0_START_OFFSET                          (0x230)
#define SF_CTRL_SF_AES_REGION_R0_START                          SF_CTRL_SF_AES_REGION_R0_START
#define SF_CTRL_SF_AES_REGION_R0_START_POS                      (0U)
#define SF_CTRL_SF_AES_REGION_R0_START_LEN                      (19U)
#define SF_CTRL_SF_AES_REGION_R0_START_MSK                      (((1U<<SF_CTRL_SF_AES_REGION_R0_START_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_START_POS)
#define SF_CTRL_SF_AES_REGION_R0_START_UMSK                     (~(((1U<<SF_CTRL_SF_AES_REGION_R0_START_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_START_POS))
#define SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN                      SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN
#define SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN_POS                  (29U)
#define SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN_LEN                  (1U)
#define SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN_MSK                  (((1U<<SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN_POS)
#define SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN_UMSK                 (~(((1U<<SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_HW_KEY_EN_POS))
#define SF_CTRL_SF_AES_REGION_R0_EN                             SF_CTRL_SF_AES_REGION_R0_EN
#define SF_CTRL_SF_AES_REGION_R0_EN_POS                         (30U)
#define SF_CTRL_SF_AES_REGION_R0_EN_LEN                         (1U)
#define SF_CTRL_SF_AES_REGION_R0_EN_MSK                         (((1U<<SF_CTRL_SF_AES_REGION_R0_EN_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_EN_POS)
#define SF_CTRL_SF_AES_REGION_R0_EN_UMSK                        (~(((1U<<SF_CTRL_SF_AES_REGION_R0_EN_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_EN_POS))
#define SF_CTRL_SF_AES_REGION_R0_LOCK                           SF_CTRL_SF_AES_REGION_R0_LOCK
#define SF_CTRL_SF_AES_REGION_R0_LOCK_POS                       (31U)
#define SF_CTRL_SF_AES_REGION_R0_LOCK_LEN                       (1U)
#define SF_CTRL_SF_AES_REGION_R0_LOCK_MSK                       (((1U<<SF_CTRL_SF_AES_REGION_R0_LOCK_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_LOCK_POS)
#define SF_CTRL_SF_AES_REGION_R0_LOCK_UMSK                      (~(((1U<<SF_CTRL_SF_AES_REGION_R0_LOCK_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_LOCK_POS))

