bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x234 : sf_aes_r0_end */
#define SF_CTRL_SF_AES_R0_END_OFFSET                            (0x234)
#define SF_CTRL_SF_AES_REGION_R0_END                            SF_CTRL_SF_AES_REGION_R0_END
#define SF_CTRL_SF_AES_REGION_R0_END_POS                        (0U)
#define SF_CTRL_SF_AES_REGION_R0_END_LEN                        (19U)
#define SF_CTRL_SF_AES_REGION_R0_END_MSK                        (((1U<<SF_CTRL_SF_AES_REGION_R0_END_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_END_POS)
#define SF_CTRL_SF_AES_REGION_R0_END_UMSK                       (~(((1U<<SF_CTRL_SF_AES_REGION_R0_END_LEN)-1)<<SF_CTRL_SF_AES_REGION_R0_END_POS))

/* 0x280 : sf_aes_key_r1_0 */
#define SF_CTRL_SF_AES_KEY_R1_0_OFFSET                          (0x280)
#define SF_CTRL_SF_AES_KEY_R1_0                                 SF_CTRL_SF_AES_KEY_R1_0
#define SF_CTRL_SF_AES_KEY_R1_0_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R1_0_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R1_0_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R1_0_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_0_POS)
#define SF_CTRL_SF_AES_KEY_R1_0_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R1_0_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_0_POS))

/* 0x284 : sf_aes_key_r1_1 */
#define SF_CTRL_SF_AES_KEY_R1_1_OFFSET                          (0x284)
#define SF_CTRL_SF_AES_KEY_R1_1                                 SF_CTRL_SF_AES_KEY_R1_1
#define SF_CTRL_SF_AES_KEY_R1_1_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R1_1_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R1_1_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R1_1_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_1_POS)
#define SF_CTRL_SF_AES_KEY_R1_1_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R1_1_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_1_POS))

/* 0x288 : sf_aes_key_r1_2 */
#define SF_CTRL_SF_AES_KEY_R1_2_OFFSET                          (0x288)
#define SF_CTRL_SF_AES_KEY_R1_2                                 SF_CTRL_SF_AES_KEY_R1_2
#define SF_CTRL_SF_AES_KEY_R1_2_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R1_2_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R1_2_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R1_2_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_2_POS)
#define SF_CTRL_SF_AES_KEY_R1_2_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R1_2_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_2_POS))

/* 0x28C : sf_aes_key_r1_3 */
#define SF_CTRL_SF_AES_KEY_R1_3_OFFSET                          (0x28C)
#define SF_CTRL_SF_AES_KEY_R1_3                                 SF_CTRL_SF_AES_KEY_R1_3
#define SF_CTRL_SF_AES_KEY_R1_3_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R1_3_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R1_3_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R1_3_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_3_POS)
#define SF_CTRL_SF_AES_KEY_R1_3_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R1_3_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_3_POS))

/* 0x290 : sf_aes_key_r1_4 */
#define SF_CTRL_SF_AES_KEY_R1_4_OFFSET                          (0x290)
#define SF_CTRL_SF_AES_KEY_R1_4                                 SF_CTRL_SF_AES_KEY_R1_4
#define SF_CTRL_SF_AES_KEY_R1_4_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R1_4_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R1_4_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R1_4_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_4_POS)
#define SF_CTRL_SF_AES_KEY_R1_4_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R1_4_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_4_POS))

/* 0x294 : sf_aes_key_r1_5 */
#define SF_CTRL_SF_AES_KEY_R1_5_OFFSET                          (0x294)
#define SF_CTRL_SF_AES_KEY_R1_5                                 SF_CTRL_SF_AES_KEY_R1_5
#define SF_CTRL_SF_AES_KEY_R1_5_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R1_5_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R1_5_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R1_5_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_5_POS)
#define SF_CTRL_SF_AES_KEY_R1_5_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R1_5_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_5_POS))

/* 0x298 : sf_aes_key_r1_6 */
#define SF_CTRL_SF_AES_KEY_R1_6_OFFSET                          (0x298)
#define SF_CTRL_SF_AES_KEY_R1_6                                 SF_CTRL_SF_AES_KEY_R1_6
#define SF_CTRL_SF_AES_KEY_R1_6_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R1_6_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R1_6_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R1_6_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_6_POS)
#define SF_CTRL_SF_AES_KEY_R1_6_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R1_6_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_6_POS))

/* 0x29C : sf_aes_key_r1_7 */
#define SF_CTRL_SF_AES_KEY_R1_7_OFFSET                          (0x29C)
#define SF_CTRL_SF_AES_KEY_R1_7                                 SF_CTRL_SF_AES_KEY_R1_7
#define SF_CTRL_SF_AES_KEY_R1_7_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R1_7_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R1_7_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R1_7_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_7_POS)
#define SF_CTRL_SF_AES_KEY_R1_7_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R1_7_LEN)-1)<<SF_CTRL_SF_AES_KEY_R1_7_POS))

/* 0x2A0 : sf_aes_iv_r1_w0 */
#define SF_CTRL_SF_AES_IV_R1_W0_OFFSET                          (0x2A0)
#define SF_CTRL_SF_AES_IV_R1_W0                                 SF_CTRL_SF_AES_IV_R1_W0
#define SF_CTRL_SF_AES_IV_R1_W0_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R1_W0_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R1_W0_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R1_W0_LEN)-1)<<SF_CTRL_SF_AES_IV_R1_W0_POS)
#define SF_CTRL_SF_AES_IV_R1_W0_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R1_W0_LEN)-1)<<SF_CTRL_SF_AES_IV_R1_W0_POS))

/* 0x2A4 : sf_aes_iv_r1_w1 */
#define SF_CTRL_SF_AES_IV_R1_W1_OFFSET                          (0x2A4)
#define SF_CTRL_SF_AES_IV_R1_W1                                 SF_CTRL_SF_AES_IV_R1_W1
#define SF_CTRL_SF_AES_IV_R1_W1_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R1_W1_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R1_W1_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R1_W1_LEN)-1)<<SF_CTRL_SF_AES_IV_R1_W1_POS)
#define SF_CTRL_SF_AES_IV_R1_W1_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R1_W1_LEN)-1)<<SF_CTRL_SF_AES_IV_R1_W1_POS))

/* 0x2A8 : sf_aes_iv_r1_w2 */
#define SF_CTRL_SF_AES_IV_R1_W2_OFFSET                          (0x2A8)
#define SF_CTRL_SF_AES_IV_R1_W2                                 SF_CTRL_SF_AES_IV_R1_W2
#define SF_CTRL_SF_AES_IV_R1_W2_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R1_W2_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R1_W2_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R1_W2_LEN)-1)<<SF_CTRL_SF_AES_IV_R1_W2_POS)
#define SF_CTRL_SF_AES_IV_R1_W2_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R1_W2_LEN)-1)<<SF_CTRL_SF_AES_IV_R1_W2_POS))

/* 0x2AC : sf_aes_iv_r1_w3 */
#define SF_CTRL_SF_AES_IV_R1_W3_OFFSET                          (0x2AC)
#define SF_CTRL_SF_AES_IV_R1_W3                                 SF_CTRL_SF_AES_IV_R1_W3
#define SF_CTRL_SF_AES_IV_R1_W3_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R1_W3_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R1_W3_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R1_W3_LEN)-1)<<SF_CTRL_SF_AES_IV_R1_W3_POS)
#define SF_CTRL_SF_AES_IV_R1_W3_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R1_W3_LEN)-1)<<SF_CTRL_SF_AES_IV_R1_W3_POS))

