bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x2B0 : sf_aes_r1_start */
#define SF_CTRL_SF_AES_R1_START_OFFSET                          (0x2B0)
#define SF_CTRL_SF_AES_R1_START                                 SF_CTRL_SF_AES_R1_START
#define SF_CTRL_SF_AES_R1_START_POS                             (0U)
#define SF_CTRL_SF_AES_R1_START_LEN                             (19U)
#define SF_CTRL_SF_AES_R1_START_MSK                             (((1U<<SF_CTRL_SF_AES_R1_START_LEN)-1)<<SF_CTRL_SF_AES_R1_START_POS)
#define SF_CTRL_SF_AES_R1_START_UMSK                            (~(((1U<<SF_CTRL_SF_AES_R1_START_LEN)-1)<<SF_CTRL_SF_AES_R1_START_POS))
#define SF_CTRL_SF_AES_R1_HW_KEY_EN                             SF_CTRL_SF_AES_R1_HW_KEY_EN
#define SF_CTRL_SF_AES_R1_HW_KEY_EN_POS                         (29U)
#define SF_CTRL_SF_AES_R1_HW_KEY_EN_LEN                         (1U)
#define SF_CTRL_SF_AES_R1_HW_KEY_EN_MSK                         (((1U<<SF_CTRL_SF_AES_R1_HW_KEY_EN_LEN)-1)<<SF_CTRL_SF_AES_R1_HW_KEY_EN_POS)
#define SF_CTRL_SF_AES_R1_HW_KEY_EN_UMSK                        (~(((1U<<SF_CTRL_SF_AES_R1_HW_KEY_EN_LEN)-1)<<SF_CTRL_SF_AES_R1_HW_KEY_EN_POS))
#define SF_CTRL_SF_AES_R1_EN                                    SF_CTRL_SF_AES_R1_EN
#define SF_CTRL_SF_AES_R1_EN_POS                                (30U)
#define SF_CTRL_SF_AES_R1_EN_LEN                                (1U)
#define SF_CTRL_SF_AES_R1_EN_MSK                                (((1U<<SF_CTRL_SF_AES_R1_EN_LEN)-1)<<SF_CTRL_SF_AES_R1_EN_POS)
#define SF_CTRL_SF_AES_R1_EN_UMSK                               (~(((1U<<SF_CTRL_SF_AES_R1_EN_LEN)-1)<<SF_CTRL_SF_AES_R1_EN_POS))
#define SF_CTRL_SF_AES_R1_LOCK                                  SF_CTRL_SF_AES_R1_LOCK
#define SF_CTRL_SF_AES_R1_LOCK_POS                              (31U)
#define SF_CTRL_SF_AES_R1_LOCK_LEN                              (1U)
#define SF_CTRL_SF_AES_R1_LOCK_MSK                              (((1U<<SF_CTRL_SF_AES_R1_LOCK_LEN)-1)<<SF_CTRL_SF_AES_R1_LOCK_POS)
#define SF_CTRL_SF_AES_R1_LOCK_UMSK                             (~(((1U<<SF_CTRL_SF_AES_R1_LOCK_LEN)-1)<<SF_CTRL_SF_AES_R1_LOCK_POS))

/* 0x2B4 : sf_aes_r1_end */
#define SF_CTRL_SF_AES_R1_END_OFFSET                            (0x2B4)
#define SF_CTRL_SF_AES_R1_END                                   SF_CTRL_SF_AES_R1_END
#define SF_CTRL_SF_AES_R1_END_POS                               (0U)
#define SF_CTRL_SF_AES_R1_END_LEN                               (19U)
#define SF_CTRL_SF_AES_R1_END_MSK                               (((1U<<SF_CTRL_SF_AES_R1_END_LEN)-1)<<SF_CTRL_SF_AES_R1_END_POS)
#define SF_CTRL_SF_AES_R1_END_UMSK                              (~(((1U<<SF_CTRL_SF_AES_R1_END_LEN)-1)<<SF_CTRL_SF_AES_R1_END_POS))

/* 0x300 : sf_aes_key_r2_0 */
#define SF_CTRL_SF_AES_KEY_R2_0_OFFSET                          (0x300)
#define SF_CTRL_SF_AES_KEY_R2_0                                 SF_CTRL_SF_AES_KEY_R2_0
#define SF_CTRL_SF_AES_KEY_R2_0_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R2_0_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R2_0_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R2_0_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_0_POS)
#define SF_CTRL_SF_AES_KEY_R2_0_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R2_0_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_0_POS))

/* 0x304 : sf_aes_key_r2_1 */
#define SF_CTRL_SF_AES_KEY_R2_1_OFFSET                          (0x304)
#define SF_CTRL_SF_AES_KEY_R2_1                                 SF_CTRL_SF_AES_KEY_R2_1
#define SF_CTRL_SF_AES_KEY_R2_1_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R2_1_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R2_1_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R2_1_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_1_POS)
#define SF_CTRL_SF_AES_KEY_R2_1_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R2_1_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_1_POS))

/* 0x308 : sf_aes_key_r2_2 */
#define SF_CTRL_SF_AES_KEY_R2_2_OFFSET                          (0x308)
#define SF_CTRL_SF_AES_KEY_R2_2                                 SF_CTRL_SF_AES_KEY_R2_2
#define SF_CTRL_SF_AES_KEY_R2_2_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R2_2_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R2_2_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R2_2_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_2_POS)
#define SF_CTRL_SF_AES_KEY_R2_2_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R2_2_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_2_POS))

/* 0x30C : sf_aes_key_r2_3 */
#define SF_CTRL_SF_AES_KEY_R2_3_OFFSET                          (0x30C)
#define SF_CTRL_SF_AES_KEY_R2_3                                 SF_CTRL_SF_AES_KEY_R2_3
#define SF_CTRL_SF_AES_KEY_R2_3_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R2_3_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R2_3_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R2_3_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_3_POS)
#define SF_CTRL_SF_AES_KEY_R2_3_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R2_3_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_3_POS))

/* 0x310 : sf_aes_key_r2_4 */
#define SF_CTRL_SF_AES_KEY_R2_4_OFFSET                          (0x310)
#define SF_CTRL_SF_AES_KEY_R2_4                                 SF_CTRL_SF_AES_KEY_R2_4
#define SF_CTRL_SF_AES_KEY_R2_4_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R2_4_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R2_4_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R2_4_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_4_POS)
#define SF_CTRL_SF_AES_KEY_R2_4_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R2_4_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_4_POS))

/* 0x314 : sf_aes_key_r2_5 */
#define SF_CTRL_SF_AES_KEY_R2_5_OFFSET                          (0x314)
#define SF_CTRL_SF_AES_KEY_R2_5                                 SF_CTRL_SF_AES_KEY_R2_5
#define SF_CTRL_SF_AES_KEY_R2_5_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R2_5_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R2_5_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R2_5_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_5_POS)
#define SF_CTRL_SF_AES_KEY_R2_5_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R2_5_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_5_POS))

/* 0x318 : sf_aes_key_r2_6 */
#define SF_CTRL_SF_AES_KEY_R2_6_OFFSET                          (0x318)
#define SF_CTRL_SF_AES_KEY_R2_6                                 SF_CTRL_SF_AES_KEY_R2_6
#define SF_CTRL_SF_AES_KEY_R2_6_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R2_6_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R2_6_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R2_6_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_6_POS)
#define SF_CTRL_SF_AES_KEY_R2_6_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R2_6_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_6_POS))

/* 0x31C : sf_aes_key_r2_7 */
#define SF_CTRL_SF_AES_KEY_R2_7_OFFSET                          (0x31C)
#define SF_CTRL_SF_AES_KEY_R2_7                                 SF_CTRL_SF_AES_KEY_R2_7
#define SF_CTRL_SF_AES_KEY_R2_7_POS                             (0U)
#define SF_CTRL_SF_AES_KEY_R2_7_LEN                             (32U)
#define SF_CTRL_SF_AES_KEY_R2_7_MSK                             (((1U<<SF_CTRL_SF_AES_KEY_R2_7_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_7_POS)
#define SF_CTRL_SF_AES_KEY_R2_7_UMSK                            (~(((1U<<SF_CTRL_SF_AES_KEY_R2_7_LEN)-1)<<SF_CTRL_SF_AES_KEY_R2_7_POS))

/* 0x320 : sf_aes_iv_r2_w0 */
#define SF_CTRL_SF_AES_IV_R2_W0_OFFSET                          (0x320)
#define SF_CTRL_SF_AES_IV_R2_W0                                 SF_CTRL_SF_AES_IV_R2_W0
#define SF_CTRL_SF_AES_IV_R2_W0_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R2_W0_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R2_W0_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R2_W0_LEN)-1)<<SF_CTRL_SF_AES_IV_R2_W0_POS)
#define SF_CTRL_SF_AES_IV_R2_W0_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R2_W0_LEN)-1)<<SF_CTRL_SF_AES_IV_R2_W0_POS))

/* 0x324 : sf_aes_iv_r2_w1 */
#define SF_CTRL_SF_AES_IV_R2_W1_OFFSET                          (0x324)
#define SF_CTRL_SF_AES_IV_R2_W1                                 SF_CTRL_SF_AES_IV_R2_W1
#define SF_CTRL_SF_AES_IV_R2_W1_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R2_W1_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R2_W1_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R2_W1_LEN)-1)<<SF_CTRL_SF_AES_IV_R2_W1_POS)
#define SF_CTRL_SF_AES_IV_R2_W1_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R2_W1_LEN)-1)<<SF_CTRL_SF_AES_IV_R2_W1_POS))

