bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x328 : sf_aes_iv_r2_w2 */
#define SF_CTRL_SF_AES_IV_R2_W2_OFFSET                          (0x328)
#define SF_CTRL_SF_AES_IV_R2_W2                                 SF_CTRL_SF_AES_IV_R2_W2
#define SF_CTRL_SF_AES_IV_R2_W2_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R2_W2_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R2_W2_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R2_W2_LEN)-1)<<SF_CTRL_SF_AES_IV_R2_W2_POS)
#define SF_CTRL_SF_AES_IV_R2_W2_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R2_W2_LEN)-1)<<SF_CTRL_SF_AES_IV_R2_W2_POS))

/* 0x32C : sf_aes_iv_r2_w3 */
#define SF_CTRL_SF_AES_IV_R2_W3_OFFSET                          (0x32C)
#define SF_CTRL_SF_AES_IV_R2_W3                                 SF_CTRL_SF_AES_IV_R2_W3
#define SF_CTRL_SF_AES_IV_R2_W3_POS                             (0U)
#define SF_CTRL_SF_AES_IV_R2_W3_LEN                             (32U)
#define SF_CTRL_SF_AES_IV_R2_W3_MSK                             (((1U<<SF_CTRL_SF_AES_IV_R2_W3_LEN)-1)<<SF_CTRL_SF_AES_IV_R2_W3_POS)
#define SF_CTRL_SF_AES_IV_R2_W3_UMSK                            (~(((1U<<SF_CTRL_SF_AES_IV_R2_W3_LEN)-1)<<SF_CTRL_SF_AES_IV_R2_W3_POS))

/* 0x330 : sf_aes_r2_start */
#define SF_CTRL_SF_AES_R2_START_OFFSET                          (0x330)
#define SF_CTRL_SF_AES_R2_START                                 SF_CTRL_SF_AES_R2_START
#define SF_CTRL_SF_AES_R2_START_POS                             (0U)
#define SF_CTRL_SF_AES_R2_START_LEN                             (19U)
#define SF_CTRL_SF_AES_R2_START_MSK                             (((1U<<SF_CTRL_SF_AES_R2_START_LEN)-1)<<SF_CTRL_SF_AES_R2_START_POS)
#define SF_CTRL_SF_AES_R2_START_UMSK                            (~(((1U<<SF_CTRL_SF_AES_R2_START_LEN)-1)<<SF_CTRL_SF_AES_R2_START_POS))
#define SF_CTRL_SF_AES_R2_HW_KEY_EN                             SF_CTRL_SF_AES_R2_HW_KEY_EN
#define SF_CTRL_SF_AES_R2_HW_KEY_EN_POS                         (29U)
#define SF_CTRL_SF_AES_R2_HW_KEY_EN_LEN                         (1U)
#define SF_CTRL_SF_AES_R2_HW_KEY_EN_MSK                         (((1U<<SF_CTRL_SF_AES_R2_HW_KEY_EN_LEN)-1)<<SF_CTRL_SF_AES_R2_HW_KEY_EN_POS)
#define SF_CTRL_SF_AES_R2_HW_KEY_EN_UMSK                        (~(((1U<<SF_CTRL_SF_AES_R2_HW_KEY_EN_LEN)-1)<<SF_CTRL_SF_AES_R2_HW_KEY_EN_POS))
#define SF_CTRL_SF_AES_R2_EN                                    SF_CTRL_SF_AES_R2_EN
#define SF_CTRL_SF_AES_R2_EN_POS                                (30U)
#define SF_CTRL_SF_AES_R2_EN_LEN                                (1U)
#define SF_CTRL_SF_AES_R2_EN_MSK                                (((1U<<SF_CTRL_SF_AES_R2_EN_LEN)-1)<<SF_CTRL_SF_AES_R2_EN_POS)
#define SF_CTRL_SF_AES_R2_EN_UMSK                               (~(((1U<<SF_CTRL_SF_AES_R2_EN_LEN)-1)<<SF_CTRL_SF_AES_R2_EN_POS))
#define SF_CTRL_SF_AES_R2_LOCK                                  SF_CTRL_SF_AES_R2_LOCK
#define SF_CTRL_SF_AES_R2_LOCK_POS                              (31U)
#define SF_CTRL_SF_AES_R2_LOCK_LEN                              (1U)
#define SF_CTRL_SF_AES_R2_LOCK_MSK                              (((1U<<SF_CTRL_SF_AES_R2_LOCK_LEN)-1)<<SF_CTRL_SF_AES_R2_LOCK_POS)
#define SF_CTRL_SF_AES_R2_LOCK_UMSK                             (~(((1U<<SF_CTRL_SF_AES_R2_LOCK_LEN)-1)<<SF_CTRL_SF_AES_R2_LOCK_POS))

/* 0x334 : sf_aes_r2_end */
#define SF_CTRL_SF_AES_R2_END_OFFSET                            (0x334)
#define SF_CTRL_SF_AES_R2_END                                   SF_CTRL_SF_AES_R2_END
#define SF_CTRL_SF_AES_R2_END_POS                               (0U)
#define SF_CTRL_SF_AES_R2_END_LEN                               (19U)
#define SF_CTRL_SF_AES_R2_END_MSK                               (((1U<<SF_CTRL_SF_AES_R2_END_LEN)-1)<<SF_CTRL_SF_AES_R2_END_POS)
#define SF_CTRL_SF_AES_R2_END_UMSK                              (~(((1U<<SF_CTRL_SF_AES_R2_END_LEN)-1)<<SF_CTRL_SF_AES_R2_END_POS))


struct  sf_ctrl_reg {
    /* 0x0 : sf_ctrl_0 */
    union {
        struct {
            uint32_t reserved_0_1                   :  2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t sf_clk_sf_rx_inv_sel           :  1; /* [    2],        r/w,        0x1 */
            uint32_t sf_clk_out_gate_en             :  1; /* [    3],        r/w,        0x1 */
            uint32_t sf_clk_out_inv_sel             :  1; /* [    4],        r/w,        0x1 */
            uint32_t reserved_5_7                   :  3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t sf_if_read_dly_n               :  3; /* [10: 8],        r/w,        0x0 */
            uint32_t sf_if_read_dly_en              :  1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t sf_if_int                      :  1; /* [   16],          r,        0x0 */
            uint32_t sf_if_int_clr                  :  1; /* [   17],        r/w,        0x1 */
            uint32_t sf_if_int_set                  :  1; /* [   18],        r/w,        0x0 */
            uint32_t sf_if_32b_adr_en               :  1; /* [   19],        r/w,        0x0 */
            uint32_t sf_aes_dout_endian             :  1; /* [   20],        r/w,        0x1 */
            uint32_t sf_aes_din_endian              :  1; /* [   21],        r/w,        0x1 */
            uint32_t sf_aes_key_endian              :  1; /* [   22],        r/w,        0x1 */
            uint32_t sf_aes_iv_endian               :  1; /* [   23],        r/w,        0x1 */
            uint32_t sf_id                          :  8; /* [31:24],        r/w,       0x1a */
        }BF;
        uint32_t WORD;
    } sf_ctrl_0;

    /* 0x4 : sf_ctrl_1 */
    union {
        struct {
            uint32_t sf_if_sr_pat_mask              :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t sf_if_sr_pat                   :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t sf_if_sr_int                   :  1; /* [   16],          r,        0x0 */
            uint32_t sf_if_sr_int_en                :  1; /* [   17],        r/w,        0x0 */
            uint32_t sf_if_sr_int_set               :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t sf_if_0_ack_lat                :  3; /* [22:20],        r/w,        0x6 */
            uint32_t sf_ahb2sif_diswrap             :  1; /* [   23],        r/w,        0x0 */
            uint32_t sf_if_reg_hold                 :  1; /* [   24],        r/w,        0x1 */
            uint32_t sf_if_reg_wp                   :  1; /* [   25],        r/w,        0x1 */
            uint32_t sf_ahb2sif_stopped             :  1; /* [   26],          r,        0x0 */
            uint32_t sf_ahb2sif_stop                :  1; /* [   27],        r/w,        0x0 */
            uint32_t sf_if_fn_sel                   :  1; /* [   28],        r/w,        0x1 */
            uint32_t sf_if_en                       :  1; /* [   29],        r/w,        0x1 */
            uint32_t sf_ahb2sif_en                  :  1; /* [   30],        r/w,        0x1 */
            uint32_t sf_ahb2sram_en                 :  1; /* [   31],        r/w,        0x1 */
        }BF;
        uint32_t WORD;
    } sf_ctrl_1;

