bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
    /* 0x94 : sf_if_iahb_10 */
    union {
        struct {
            uint32_t sf_if_4_cmd_buf_0              : 32; /* [31: 0],        r/w, 0xeb000000L */
        }BF;
        uint32_t WORD;
    } sf_if_iahb_10;

    /* 0x98 : sf_if_iahb_11 */
    union {
        struct {
            uint32_t sf_if_4_cmd_buf_1              : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_if_iahb_11;

    /* 0x9C : sf_if_iahb_12 */
    union {
        struct {
            uint32_t reserved_0_1                   :  2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t sf2_clk_sf_rx_inv_sel          :  1; /* [    2],        r/w,        0x0 */
            uint32_t sf2_clk_sf_rx_inv_src          :  1; /* [    3],        r/w,        0x0 */
            uint32_t sf2_clk_out_inv_sel            :  1; /* [    4],        r/w,        0x1 */
            uint32_t sf3_clk_out_inv_sel            :  1; /* [    5],        r/w,        0x1 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t sf2_if_read_dly_n              :  3; /* [10: 8],        r/w,        0x0 */
            uint32_t sf2_if_read_dly_en             :  1; /* [   11],        r/w,        0x0 */
            uint32_t sf2_if_read_dly_src            :  1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31                 : 19; /* [31:13],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_if_iahb_12;

    /* 0xA0 : sf_id0_offset */
    union {
        struct {
            uint32_t sf_id0_offset                  : 28; /* [27: 0],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_id0_offset;

    /* 0xA4 : sf_id1_offset */
    union {
        struct {
            uint32_t sf_id1_offset                  : 28; /* [27: 0],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_id1_offset;

    /* 0xA8 : sf_bk2_id0_offset */
    union {
        struct {
            uint32_t sf_bk2_id0_offset              : 28; /* [27: 0],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_bk2_id0_offset;

    /* 0xAC : sf_bk2_id1_offset */
    union {
        struct {
            uint32_t sf_bk2_id1_offset              : 28; /* [27: 0],        r/w,        0x0 */
            uint32_t reserved_28_31                 :  4; /* [31:28],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_bk2_id1_offset;

    /* 0xB0 : sf_dbg */
    union {
        struct {
            uint32_t sf_autoload_st                 :  5; /* [ 4: 0],          r,        0x1 */
            uint32_t sf_autoload_st_done            :  1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_31                  : 26; /* [31: 6],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_dbg;

    /* 0xb4  reserved */
    uint8_t RESERVED0xb4[12];

    /* 0xC0 : sf_if2_ctrl_0 */
    union {
        struct {
            uint32_t reserved_0_1                   :  2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t sf_clk_sf_if2_rx_inv_sel       :  1; /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_7                   :  5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t sf_if2_read_dly_n              :  3; /* [10: 8],        r/w,        0x0 */
            uint32_t sf_if2_read_dly_en             :  1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15                 :  4; /* [15:12],       rsvd,        0x0 */
            uint32_t sf_if2_int                     :  1; /* [   16],          r,        0x0 */
            uint32_t sf_if2_int_clr                 :  1; /* [   17],        r/w,        0x1 */
            uint32_t sf_if2_int_set                 :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19_22                 :  4; /* [22:19],       rsvd,        0x0 */
            uint32_t sf_if2_replace_sf1             :  1; /* [   23],        r/w,        0x0 */
            uint32_t sf_if2_replace_sf2             :  1; /* [   24],        r/w,        0x0 */
            uint32_t sf_if2_replace_sf3             :  1; /* [   25],        r/w,        0x0 */
            uint32_t sf_if2_pad_sel                 :  2; /* [27:26],        r/w,        0x0 */
            uint32_t sf_if2_bk_swap                 :  1; /* [   28],        r/w,        0x0 */
            uint32_t sf_if2_bk2_mode                :  1; /* [   29],        r/w,        0x0 */
            uint32_t sf_if2_bk2_en                  :  1; /* [   30],        r/w,        0x0 */
            uint32_t sf_if2_bk_sel                  :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_if2_ctrl_0;

    /* 0xC4 : sf_if2_ctrl_1 */
    union {
        struct {
            uint32_t sf_if2_sr_pat_mask             :  8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t sf_if2_sr_pat                  :  8; /* [15: 8],        r/w,        0x0 */
            uint32_t sf_if2_sr_int                  :  1; /* [   16],          r,        0x0 */
            uint32_t sf_if2_sr_int_en               :  1; /* [   17],        r/w,        0x0 */
            uint32_t sf_if2_sr_int_set              :  1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t sf_if2_ack_lat                 :  3; /* [22:20],        r/w,        0x6 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t sf_if2_reg_hold                :  1; /* [   24],        r/w,        0x1 */
            uint32_t sf_if2_reg_wp                  :  1; /* [   25],        r/w,        0x1 */
            uint32_t reserved_26_27                 :  2; /* [27:26],       rsvd,        0x0 */
            uint32_t sf_if2_fn_sel                  :  1; /* [   28],        r/w,        0x0 */
            uint32_t sf_if2_en                      :  1; /* [   29],        r/w,        0x1 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_if2_ctrl_1;

