bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
    /* 0x234 : sf_aes_r0_end */
    union {
        struct {
            uint32_t sf_aes_region_r0_end           : 19; /* [18: 0],        r/w,     0x3fff */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_r0_end;

    /* 0x238  reserved */
    uint8_t RESERVED0x238[72];

    /* 0x280 : sf_aes_key_r1_0 */
    union {
        struct {
            uint32_t sf_aes_key_r1_0                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r1_0;

    /* 0x284 : sf_aes_key_r1_1 */
    union {
        struct {
            uint32_t sf_aes_key_r1_1                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r1_1;

    /* 0x288 : sf_aes_key_r1_2 */
    union {
        struct {
            uint32_t sf_aes_key_r1_2                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r1_2;

    /* 0x28C : sf_aes_key_r1_3 */
    union {
        struct {
            uint32_t sf_aes_key_r1_3                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r1_3;

    /* 0x290 : sf_aes_key_r1_4 */
    union {
        struct {
            uint32_t sf_aes_key_r1_4                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r1_4;

    /* 0x294 : sf_aes_key_r1_5 */
    union {
        struct {
            uint32_t sf_aes_key_r1_5                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r1_5;

    /* 0x298 : sf_aes_key_r1_6 */
    union {
        struct {
            uint32_t sf_aes_key_r1_6                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r1_6;

    /* 0x29C : sf_aes_key_r1_7 */
    union {
        struct {
            uint32_t sf_aes_key_r1_7                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r1_7;

    /* 0x2A0 : sf_aes_iv_r1_w0 */
    union {
        struct {
            uint32_t sf_aes_iv_r1_w0                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_r1_w0;

    /* 0x2A4 : sf_aes_iv_r1_w1 */
    union {
        struct {
            uint32_t sf_aes_iv_r1_w1                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_r1_w1;

    /* 0x2A8 : sf_aes_iv_r1_w2 */
    union {
        struct {
            uint32_t sf_aes_iv_r1_w2                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_r1_w2;

    /* 0x2AC : sf_aes_iv_r1_w3 */
    union {
        struct {
            uint32_t sf_aes_iv_r1_w3                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_r1_w3;

    /* 0x2B0 : sf_aes_r1_start */
    union {
        struct {
            uint32_t sf_aes_r1_start                : 19; /* [18: 0],        r/w,        0x0 */
            uint32_t reserved_19_28                 : 10; /* [28:19],       rsvd,        0x0 */
            uint32_t sf_aes_r1_hw_key_en            :  1; /* [   29],        r/w,        0x0 */
            uint32_t sf_aes_r1_en                   :  1; /* [   30],        r/w,        0x0 */
            uint32_t sf_aes_r1_lock                 :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_r1_start;

    /* 0x2B4 : sf_aes_r1_end */
    union {
        struct {
            uint32_t sf_aes_r1_end                  : 19; /* [18: 0],        r/w,     0x3fff */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_r1_end;

    /* 0x2b8  reserved */
    uint8_t RESERVED0x2b8[72];

    /* 0x300 : sf_aes_key_r2_0 */
    union {
        struct {
            uint32_t sf_aes_key_r2_0                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r2_0;

    /* 0x304 : sf_aes_key_r2_1 */
    union {
        struct {
            uint32_t sf_aes_key_r2_1                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r2_1;

    /* 0x308 : sf_aes_key_r2_2 */
    union {
        struct {
            uint32_t sf_aes_key_r2_2                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r2_2;

    /* 0x30C : sf_aes_key_r2_3 */
    union {
        struct {
            uint32_t sf_aes_key_r2_3                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r2_3;

    /* 0x310 : sf_aes_key_r2_4 */
    union {
        struct {
            uint32_t sf_aes_key_r2_4                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r2_4;

    /* 0x314 : sf_aes_key_r2_5 */
    union {
        struct {
            uint32_t sf_aes_key_r2_5                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r2_5;

    /* 0x318 : sf_aes_key_r2_6 */
    union {
        struct {
            uint32_t sf_aes_key_r2_6                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r2_6;

    /* 0x31C : sf_aes_key_r2_7 */
    union {
        struct {
            uint32_t sf_aes_key_r2_7                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_r2_7;

    /* 0x320 : sf_aes_iv_r2_w0 */
    union {
        struct {
            uint32_t sf_aes_iv_r2_w0                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_r2_w0;

    /* 0x324 : sf_aes_iv_r2_w1 */
    union {
        struct {
            uint32_t sf_aes_iv_r2_w1                : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_r2_w1;

