bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
};

typedef volatile struct sf_if_sahb_0_reg sf_if_sahb_0_reg_t;

#define SF_CTRL_IF1_SAHB_OFFSET     0x8
#define SF_CTRL_IF2_SAHB_OFFSET     0xC8


/*Following is reg patch*/

/* 0x0 : if_io_dly_0 */
#define SF_CTRL_IO_DLY_0_OFFSET                                 (0x0)
#define SF_CTRL_CS_DLY_SEL                                      SF_CTRL_CS_DLY_SEL
#define SF_CTRL_CS_DLY_SEL_POS                                  (0U)
#define SF_CTRL_CS_DLY_SEL_LEN                                  (2U)
#define SF_CTRL_CS_DLY_SEL_MSK                                  (((1U<<SF_CTRL_CS_DLY_SEL_LEN)-1)<<SF_CTRL_CS_DLY_SEL_POS)
#define SF_CTRL_CS_DLY_SEL_UMSK                                 (~(((1U<<SF_CTRL_CS_DLY_SEL_LEN)-1)<<SF_CTRL_CS_DLY_SEL_POS))
#define SF_CTRL_CS2_DLY_SEL                                     SF_CTRL_CS2_DLY_SEL
#define SF_CTRL_CS2_DLY_SEL_POS                                 (2U)
#define SF_CTRL_CS2_DLY_SEL_LEN                                 (2U)
#define SF_CTRL_CS2_DLY_SEL_MSK                                 (((1U<<SF_CTRL_CS2_DLY_SEL_LEN)-1)<<SF_CTRL_CS2_DLY_SEL_POS)
#define SF_CTRL_CS2_DLY_SEL_UMSK                                (~(((1U<<SF_CTRL_CS2_DLY_SEL_LEN)-1)<<SF_CTRL_CS2_DLY_SEL_POS))
#define SF_CTRL_CLK_OUT_DLY_SEL                                 SF_CTRL_CLK_OUT_DLY_SEL
#define SF_CTRL_CLK_OUT_DLY_SEL_POS                             (8U)
#define SF_CTRL_CLK_OUT_DLY_SEL_LEN                             (2U)
#define SF_CTRL_CLK_OUT_DLY_SEL_MSK                             (((1U<<SF_CTRL_CLK_OUT_DLY_SEL_LEN)-1)<<SF_CTRL_CLK_OUT_DLY_SEL_POS)
#define SF_CTRL_CLK_OUT_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_CLK_OUT_DLY_SEL_LEN)-1)<<SF_CTRL_CLK_OUT_DLY_SEL_POS))
#define SF_CTRL_DQS_OE_DLY_SEL                                  SF_CTRL_DQS_OE_DLY_SEL
#define SF_CTRL_DQS_OE_DLY_SEL_POS                              (26U)
#define SF_CTRL_DQS_OE_DLY_SEL_LEN                              (2U)
#define SF_CTRL_DQS_OE_DLY_SEL_MSK                              (((1U<<SF_CTRL_DQS_OE_DLY_SEL_LEN)-1)<<SF_CTRL_DQS_OE_DLY_SEL_POS)
#define SF_CTRL_DQS_OE_DLY_SEL_UMSK                             (~(((1U<<SF_CTRL_DQS_OE_DLY_SEL_LEN)-1)<<SF_CTRL_DQS_OE_DLY_SEL_POS))
#define SF_CTRL_DQS_DI_DLY_SEL                                  SF_CTRL_DQS_DI_DLY_SEL
#define SF_CTRL_DQS_DI_DLY_SEL_POS                              (28U)
#define SF_CTRL_DQS_DI_DLY_SEL_LEN                              (2U)
#define SF_CTRL_DQS_DI_DLY_SEL_MSK                              (((1U<<SF_CTRL_DQS_DI_DLY_SEL_LEN)-1)<<SF_CTRL_DQS_DI_DLY_SEL_POS)
#define SF_CTRL_DQS_DI_DLY_SEL_UMSK                             (~(((1U<<SF_CTRL_DQS_DI_DLY_SEL_LEN)-1)<<SF_CTRL_DQS_DI_DLY_SEL_POS))
#define SF_CTRL_DQS_DO_DLY_SEL                                  SF_CTRL_DQS_DO_DLY_SEL
#define SF_CTRL_DQS_DO_DLY_SEL_POS                              (30U)
#define SF_CTRL_DQS_DO_DLY_SEL_LEN                              (2U)
#define SF_CTRL_DQS_DO_DLY_SEL_MSK                              (((1U<<SF_CTRL_DQS_DO_DLY_SEL_LEN)-1)<<SF_CTRL_DQS_DO_DLY_SEL_POS)
#define SF_CTRL_DQS_DO_DLY_SEL_UMSK                             (~(((1U<<SF_CTRL_DQS_DO_DLY_SEL_LEN)-1)<<SF_CTRL_DQS_DO_DLY_SEL_POS))

/* 0x4 : if_io_dly_1 */
#define SF_CTRL_IO_DLY_1_OFFSET                                 (0x4)
#define SF_CTRL_IO_0_OE_DLY_SEL                                 SF_CTRL_IO_0_OE_DLY_SEL
#define SF_CTRL_IO_0_OE_DLY_SEL_POS                             (0U)
#define SF_CTRL_IO_0_OE_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_0_OE_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_0_OE_DLY_SEL_LEN)-1)<<SF_CTRL_IO_0_OE_DLY_SEL_POS)
#define SF_CTRL_IO_0_OE_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_0_OE_DLY_SEL_LEN)-1)<<SF_CTRL_IO_0_OE_DLY_SEL_POS))
#define SF_CTRL_IO_0_DI_DLY_SEL                                 SF_CTRL_IO_0_DI_DLY_SEL
#define SF_CTRL_IO_0_DI_DLY_SEL_POS                             (8U)
#define SF_CTRL_IO_0_DI_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_0_DI_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_0_DI_DLY_SEL_LEN)-1)<<SF_CTRL_IO_0_DI_DLY_SEL_POS)
#define SF_CTRL_IO_0_DI_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_0_DI_DLY_SEL_LEN)-1)<<SF_CTRL_IO_0_DI_DLY_SEL_POS))
#define SF_CTRL_IO_0_DO_DLY_SEL                                 SF_CTRL_IO_0_DO_DLY_SEL
#define SF_CTRL_IO_0_DO_DLY_SEL_POS                             (16U)
#define SF_CTRL_IO_0_DO_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_0_DO_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_0_DO_DLY_SEL_LEN)-1)<<SF_CTRL_IO_0_DO_DLY_SEL_POS)
#define SF_CTRL_IO_0_DO_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_0_DO_DLY_SEL_LEN)-1)<<SF_CTRL_IO_0_DO_DLY_SEL_POS))

/* 0x8 : if_io_dly_2 */
#define SF_CTRL_IO_DLY_2_OFFSET                                 (0x8)
#define SF_CTRL_IO_1_OE_DLY_SEL                                 SF_CTRL_IO_1_OE_DLY_SEL
#define SF_CTRL_IO_1_OE_DLY_SEL_POS                             (0U)
#define SF_CTRL_IO_1_OE_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_1_OE_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_1_OE_DLY_SEL_LEN)-1)<<SF_CTRL_IO_1_OE_DLY_SEL_POS)
#define SF_CTRL_IO_1_OE_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_1_OE_DLY_SEL_LEN)-1)<<SF_CTRL_IO_1_OE_DLY_SEL_POS))
#define SF_CTRL_IO_1_DI_DLY_SEL                                 SF_CTRL_IO_1_DI_DLY_SEL
#define SF_CTRL_IO_1_DI_DLY_SEL_POS                             (8U)
#define SF_CTRL_IO_1_DI_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_1_DI_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_1_DI_DLY_SEL_LEN)-1)<<SF_CTRL_IO_1_DI_DLY_SEL_POS)
#define SF_CTRL_IO_1_DI_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_1_DI_DLY_SEL_LEN)-1)<<SF_CTRL_IO_1_DI_DLY_SEL_POS))
#define SF_CTRL_IO_1_DO_DLY_SEL                                 SF_CTRL_IO_1_DO_DLY_SEL
#define SF_CTRL_IO_1_DO_DLY_SEL_POS                             (16U)
#define SF_CTRL_IO_1_DO_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_1_DO_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_1_DO_DLY_SEL_LEN)-1)<<SF_CTRL_IO_1_DO_DLY_SEL_POS)
#define SF_CTRL_IO_1_DO_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_1_DO_DLY_SEL_LEN)-1)<<SF_CTRL_IO_1_DO_DLY_SEL_POS))

/* 0xc : if_io_dly_3 */
#define SF_CTRL_IO_DLY_3_OFFSET                                 (0xc)
#define SF_CTRL_IO_2_OE_DLY_SEL                                 SF_CTRL_IO_2_OE_DLY_SEL
#define SF_CTRL_IO_2_OE_DLY_SEL_POS                             (0U)
#define SF_CTRL_IO_2_OE_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_2_OE_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_2_OE_DLY_SEL_LEN)-1)<<SF_CTRL_IO_2_OE_DLY_SEL_POS)
#define SF_CTRL_IO_2_OE_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_2_OE_DLY_SEL_LEN)-1)<<SF_CTRL_IO_2_OE_DLY_SEL_POS))
#define SF_CTRL_IO_2_DI_DLY_SEL                                 SF_CTRL_IO_2_DI_DLY_SEL
#define SF_CTRL_IO_2_DI_DLY_SEL_POS                             (8U)
#define SF_CTRL_IO_2_DI_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_2_DI_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_2_DI_DLY_SEL_LEN)-1)<<SF_CTRL_IO_2_DI_DLY_SEL_POS)
#define SF_CTRL_IO_2_DI_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_2_DI_DLY_SEL_LEN)-1)<<SF_CTRL_IO_2_DI_DLY_SEL_POS))
#define SF_CTRL_IO_2_DO_DLY_SEL                                 SF_CTRL_IO_2_DO_DLY_SEL
#define SF_CTRL_IO_2_DO_DLY_SEL_POS                             (16U)
#define SF_CTRL_IO_2_DO_DLY_SEL_LEN                             (2U)
#define SF_CTRL_IO_2_DO_DLY_SEL_MSK                             (((1U<<SF_CTRL_IO_2_DO_DLY_SEL_LEN)-1)<<SF_CTRL_IO_2_DO_DLY_SEL_POS)
#define SF_CTRL_IO_2_DO_DLY_SEL_UMSK                            (~(((1U<<SF_CTRL_IO_2_DO_DLY_SEL_LEN)-1)<<SF_CTRL_IO_2_DO_DLY_SEL_POS))

