bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
/* 0x4 : sf_aes_key_1 */
#define SF_CTRL_SF_AES_KEY_1_OFFSET                             (0x4)
#define SF_CTRL_SF_AES_KEY_1                                    SF_CTRL_SF_AES_KEY_1
#define SF_CTRL_SF_AES_KEY_1_POS                                (0U)
#define SF_CTRL_SF_AES_KEY_1_LEN                                (32U)
#define SF_CTRL_SF_AES_KEY_1_MSK                                (((1U<<SF_CTRL_SF_AES_KEY_1_LEN)-1)<<SF_CTRL_SF_AES_KEY_1_POS)
#define SF_CTRL_SF_AES_KEY_1_UMSK                               (~(((1U<<SF_CTRL_SF_AES_KEY_1_LEN)-1)<<SF_CTRL_SF_AES_KEY_1_POS))

/* 0x8 : sf_aes_key_2 */
#define SF_CTRL_SF_AES_KEY_2_OFFSET                             (0x8)
#define SF_CTRL_SF_AES_KEY_2                                    SF_CTRL_SF_AES_KEY_2
#define SF_CTRL_SF_AES_KEY_2_POS                                (0U)
#define SF_CTRL_SF_AES_KEY_2_LEN                                (32U)
#define SF_CTRL_SF_AES_KEY_2_MSK                                (((1U<<SF_CTRL_SF_AES_KEY_2_LEN)-1)<<SF_CTRL_SF_AES_KEY_2_POS)
#define SF_CTRL_SF_AES_KEY_2_UMSK                               (~(((1U<<SF_CTRL_SF_AES_KEY_2_LEN)-1)<<SF_CTRL_SF_AES_KEY_2_POS))

/* 0xc : sf_aes_key_3 */
#define SF_CTRL_SF_AES_KEY_3_OFFSET                             (0xc)
#define SF_CTRL_SF_AES_KEY_3                                    SF_CTRL_SF_AES_KEY_3
#define SF_CTRL_SF_AES_KEY_3_POS                                (0U)
#define SF_CTRL_SF_AES_KEY_3_LEN                                (32U)
#define SF_CTRL_SF_AES_KEY_3_MSK                                (((1U<<SF_CTRL_SF_AES_KEY_3_LEN)-1)<<SF_CTRL_SF_AES_KEY_3_POS)
#define SF_CTRL_SF_AES_KEY_3_UMSK                               (~(((1U<<SF_CTRL_SF_AES_KEY_3_LEN)-1)<<SF_CTRL_SF_AES_KEY_3_POS))

/* 0x10 : sf_aes_key_4 */
#define SF_CTRL_SF_AES_KEY_4_OFFSET                             (0x10)
#define SF_CTRL_SF_AES_KEY_4                                    SF_CTRL_SF_AES_KEY_4
#define SF_CTRL_SF_AES_KEY_4_POS                                (0U)
#define SF_CTRL_SF_AES_KEY_4_LEN                                (32U)
#define SF_CTRL_SF_AES_KEY_4_MSK                                (((1U<<SF_CTRL_SF_AES_KEY_4_LEN)-1)<<SF_CTRL_SF_AES_KEY_4_POS)
#define SF_CTRL_SF_AES_KEY_4_UMSK                               (~(((1U<<SF_CTRL_SF_AES_KEY_4_LEN)-1)<<SF_CTRL_SF_AES_KEY_4_POS))

/* 0x14 : sf_aes_key_5 */
#define SF_CTRL_SF_AES_KEY_5_OFFSET                             (0x14)
#define SF_CTRL_SF_AES_KEY_5                                    SF_CTRL_SF_AES_KEY_5
#define SF_CTRL_SF_AES_KEY_5_POS                                (0U)
#define SF_CTRL_SF_AES_KEY_5_LEN                                (32U)
#define SF_CTRL_SF_AES_KEY_5_MSK                                (((1U<<SF_CTRL_SF_AES_KEY_5_LEN)-1)<<SF_CTRL_SF_AES_KEY_5_POS)
#define SF_CTRL_SF_AES_KEY_5_UMSK                               (~(((1U<<SF_CTRL_SF_AES_KEY_5_LEN)-1)<<SF_CTRL_SF_AES_KEY_5_POS))

/* 0x18 : sf_aes_key_6 */
#define SF_CTRL_SF_AES_KEY_6_OFFSET                             (0x18)
#define SF_CTRL_SF_AES_KEY_6                                    SF_CTRL_SF_AES_KEY_6
#define SF_CTRL_SF_AES_KEY_6_POS                                (0U)
#define SF_CTRL_SF_AES_KEY_6_LEN                                (32U)
#define SF_CTRL_SF_AES_KEY_6_MSK                                (((1U<<SF_CTRL_SF_AES_KEY_6_LEN)-1)<<SF_CTRL_SF_AES_KEY_6_POS)
#define SF_CTRL_SF_AES_KEY_6_UMSK                               (~(((1U<<SF_CTRL_SF_AES_KEY_6_LEN)-1)<<SF_CTRL_SF_AES_KEY_6_POS))

/* 0x1c : sf_aes_key_7 */
#define SF_CTRL_SF_AES_KEY_7_OFFSET                             (0x1c)
#define SF_CTRL_SF_AES_KEY_7                                    SF_CTRL_SF_AES_KEY_7
#define SF_CTRL_SF_AES_KEY_7_POS                                (0U)
#define SF_CTRL_SF_AES_KEY_7_LEN                                (32U)
#define SF_CTRL_SF_AES_KEY_7_MSK                                (((1U<<SF_CTRL_SF_AES_KEY_7_LEN)-1)<<SF_CTRL_SF_AES_KEY_7_POS)
#define SF_CTRL_SF_AES_KEY_7_UMSK                               (~(((1U<<SF_CTRL_SF_AES_KEY_7_LEN)-1)<<SF_CTRL_SF_AES_KEY_7_POS))

/* 0x20 : sf_aes_iv_w0 */
#define SF_CTRL_SF_AES_IV_W0_OFFSET                             (0x20)
#define SF_CTRL_SF_AES_IV_W0                                    SF_CTRL_SF_AES_IV_W0
#define SF_CTRL_SF_AES_IV_W0_POS                                (0U)
#define SF_CTRL_SF_AES_IV_W0_LEN                                (32U)
#define SF_CTRL_SF_AES_IV_W0_MSK                                (((1U<<SF_CTRL_SF_AES_IV_W0_LEN)-1)<<SF_CTRL_SF_AES_IV_W0_POS)
#define SF_CTRL_SF_AES_IV_W0_UMSK                               (~(((1U<<SF_CTRL_SF_AES_IV_W0_LEN)-1)<<SF_CTRL_SF_AES_IV_W0_POS))

/* 0x24 : sf_aes_iv_w1 */
#define SF_CTRL_SF_AES_IV_W1_OFFSET                             (0x24)
#define SF_CTRL_SF_AES_IV_W1                                    SF_CTRL_SF_AES_IV_W1
#define SF_CTRL_SF_AES_IV_W1_POS                                (0U)
#define SF_CTRL_SF_AES_IV_W1_LEN                                (32U)
#define SF_CTRL_SF_AES_IV_W1_MSK                                (((1U<<SF_CTRL_SF_AES_IV_W1_LEN)-1)<<SF_CTRL_SF_AES_IV_W1_POS)
#define SF_CTRL_SF_AES_IV_W1_UMSK                               (~(((1U<<SF_CTRL_SF_AES_IV_W1_LEN)-1)<<SF_CTRL_SF_AES_IV_W1_POS))

/* 0x28 : sf_aes_iv_w2 */
#define SF_CTRL_SF_AES_IV_W2_OFFSET                             (0x28)
#define SF_CTRL_SF_AES_IV_W2                                    SF_CTRL_SF_AES_IV_W2
#define SF_CTRL_SF_AES_IV_W2_POS                                (0U)
#define SF_CTRL_SF_AES_IV_W2_LEN                                (32U)
#define SF_CTRL_SF_AES_IV_W2_MSK                                (((1U<<SF_CTRL_SF_AES_IV_W2_LEN)-1)<<SF_CTRL_SF_AES_IV_W2_POS)
#define SF_CTRL_SF_AES_IV_W2_UMSK                               (~(((1U<<SF_CTRL_SF_AES_IV_W2_LEN)-1)<<SF_CTRL_SF_AES_IV_W2_POS))

/* 0x2c : sf_aes_iv_w3 */
#define SF_CTRL_SF_AES_IV_W3_OFFSET                             (0x2c)
#define SF_CTRL_SF_AES_IV_W3                                    SF_CTRL_SF_AES_IV_W3
#define SF_CTRL_SF_AES_IV_W3_POS                                (0U)
#define SF_CTRL_SF_AES_IV_W3_LEN                                (32U)
#define SF_CTRL_SF_AES_IV_W3_MSK                                (((1U<<SF_CTRL_SF_AES_IV_W3_LEN)-1)<<SF_CTRL_SF_AES_IV_W3_POS)
#define SF_CTRL_SF_AES_IV_W3_UMSK                               (~(((1U<<SF_CTRL_SF_AES_IV_W3_LEN)-1)<<SF_CTRL_SF_AES_IV_W3_POS))

/* 0x30 : sf_aes_start */
#define SF_CTRL_SF_AES_START_OFFSET                             (0x30)
#define SF_CTRL_SF_AES_REGION_START                             SF_CTRL_SF_AES_REGION_START
#define SF_CTRL_SF_AES_REGION_START_POS                         (0U)
#define SF_CTRL_SF_AES_REGION_START_LEN                         (19U)
#define SF_CTRL_SF_AES_REGION_START_MSK                         (((1U<<SF_CTRL_SF_AES_REGION_START_LEN)-1)<<SF_CTRL_SF_AES_REGION_START_POS)
#define SF_CTRL_SF_AES_REGION_START_UMSK                        (~(((1U<<SF_CTRL_SF_AES_REGION_START_LEN)-1)<<SF_CTRL_SF_AES_REGION_START_POS))
#define SF_CTRL_SF_AES_REGION_HW_KEY_EN                         SF_CTRL_SF_AES_REGION_HW_KEY_EN
#define SF_CTRL_SF_AES_REGION_HW_KEY_EN_POS                     (29U)
#define SF_CTRL_SF_AES_REGION_HW_KEY_EN_LEN                     (1U)
#define SF_CTRL_SF_AES_REGION_HW_KEY_EN_MSK                     (((1U<<SF_CTRL_SF_AES_REGION_HW_KEY_EN_LEN)-1)<<SF_CTRL_SF_AES_REGION_HW_KEY_EN_POS)
#define SF_CTRL_SF_AES_REGION_HW_KEY_EN_UMSK                    (~(((1U<<SF_CTRL_SF_AES_REGION_HW_KEY_EN_LEN)-1)<<SF_CTRL_SF_AES_REGION_HW_KEY_EN_POS))
#define SF_CTRL_SF_AES_REGION_EN                                SF_CTRL_SF_AES_REGION_EN
#define SF_CTRL_SF_AES_REGION_EN_POS                            (30U)
#define SF_CTRL_SF_AES_REGION_EN_LEN                            (1U)
#define SF_CTRL_SF_AES_REGION_EN_MSK                            (((1U<<SF_CTRL_SF_AES_REGION_EN_LEN)-1)<<SF_CTRL_SF_AES_REGION_EN_POS)
#define SF_CTRL_SF_AES_REGION_EN_UMSK                           (~(((1U<<SF_CTRL_SF_AES_REGION_EN_LEN)-1)<<SF_CTRL_SF_AES_REGION_EN_POS))
#define SF_CTRL_SF_AES_REGION_LOCK                              SF_CTRL_SF_AES_REGION_LOCK
#define SF_CTRL_SF_AES_REGION_LOCK_POS                          (31U)
#define SF_CTRL_SF_AES_REGION_LOCK_LEN                          (1U)
#define SF_CTRL_SF_AES_REGION_LOCK_MSK                          (((1U<<SF_CTRL_SF_AES_REGION_LOCK_LEN)-1)<<SF_CTRL_SF_AES_REGION_LOCK_POS)
#define SF_CTRL_SF_AES_REGION_LOCK_UMSK                         (~(((1U<<SF_CTRL_SF_AES_REGION_LOCK_LEN)-1)<<SF_CTRL_SF_AES_REGION_LOCK_POS))

/* 0x34 : sf_aes_end */
#define SF_CTRL_SF_AES_END_OFFSET                               (0x34)
#define SF_CTRL_SF_AES_REGION_END                               SF_CTRL_SF_AES_REGION_END
#define SF_CTRL_SF_AES_REGION_END_POS                           (0U)
#define SF_CTRL_SF_AES_REGION_END_LEN                           (19U)
#define SF_CTRL_SF_AES_REGION_END_MSK                           (((1U<<SF_CTRL_SF_AES_REGION_END_LEN)-1)<<SF_CTRL_SF_AES_REGION_END_POS)
#define SF_CTRL_SF_AES_REGION_END_UMSK                          (~(((1U<<SF_CTRL_SF_AES_REGION_END_LEN)-1)<<SF_CTRL_SF_AES_REGION_END_POS))


struct  sf_ctrl_aes_region_reg {
    /* 0x0 : sf_aes_key_0 */
    union {
        struct {
            uint32_t sf_aes_key_0                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_0;

