bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/hardware/sf_ctrl_reg.h
    /* 0x4 : sf_aes_key_1 */
    union {
        struct {
            uint32_t sf_aes_key_1                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_1;

    /* 0x8 : sf_aes_key_2 */
    union {
        struct {
            uint32_t sf_aes_key_2                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_2;

    /* 0xc : sf_aes_key_3 */
    union {
        struct {
            uint32_t sf_aes_key_3                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_3;

    /* 0x10 : sf_aes_key_4 */
    union {
        struct {
            uint32_t sf_aes_key_4                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_4;

    /* 0x14 : sf_aes_key_5 */
    union {
        struct {
            uint32_t sf_aes_key_5                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_5;

    /* 0x18 : sf_aes_key_6 */
    union {
        struct {
            uint32_t sf_aes_key_6                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_6;

    /* 0x1c : sf_aes_key_7 */
    union {
        struct {
            uint32_t sf_aes_key_7                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_key_7;

    /* 0x20 : sf_aes_iv_w0 */
    union {
        struct {
            uint32_t sf_aes_iv_w0                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_w0;

    /* 0x24 : sf_aes_iv_w1 */
    union {
        struct {
            uint32_t sf_aes_iv_w1                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_w1;

    /* 0x28 : sf_aes_iv_w2 */
    union {
        struct {
            uint32_t sf_aes_iv_w2                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_w2;

    /* 0x2c : sf_aes_iv_w3 */
    union {
        struct {
            uint32_t sf_aes_iv_w3                   : 32; /* [31: 0],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_iv_w3;

    /* 0x30 : sf_aes_start */
    union {
        struct {
            uint32_t sf_aes_region_start            : 19; /* [18: 0],        r/w,        0x0 */
            uint32_t reserved_19_28                 : 10; /* [28:19],       rsvd,        0x0 */
            uint32_t sf_aes_region_hw_key_en        :  1; /* [   29],        r/w,        0x0 */
            uint32_t sf_aes_region_en               :  1; /* [   30],        r/w,        0x0 */
            uint32_t sf_aes_region_lock             :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_start;

    /* 0x34 : sf_aes_end */
    union {
        struct {
            uint32_t sf_aes_region_end              : 19; /* [18: 0],        r/w,     0x3fff */
            uint32_t reserved_19_31                 : 13; /* [31:19],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } sf_aes_end;

};

typedef volatile struct sf_ctrl_aes_region_reg sf_ctrl_aes_region_reg_t;

#define SF_CTRL_AES_REGION_OFFSET     0x200


#endif  /* __SF_CTRL_REG_H__ */
